[
  {
    "ID": 1,
    "GroupInfo": "                                                           \r\n                                                                               Group Lineage\r\n                                                                44th Bombardment Group (Heavy)\r\n\r\nConstituted as 44th Bombardment Group (Heavy) on 20 Nov 1940.  Activated on 15 Jan 1941.  Trained with B-24’s.  Became an operational training unit in Feb 1942.  Also served on antisubmarine duty.  In Jul 1942 began intensive preparations for combat.  Moved to England, Aug-Oct 1942, for service with Eighth AF.  Operations consisted primarily of assaults against strategic targets in France, Belgium, Holland, Germany, Italy Rumania, Austria, Poland and Sicily.  Pounded submarine installations, industrial establishments, airfields, harbors, shipyards and other objectives in France and Germany, Nov 1942 - June 1943.  Received a DUC for an extremely hazardous mission against naval installations at Kid on ‘4 May 1943: with its B-24’s carrying incendiaries to be dropped after three B-17 groups had released high explosive bombs, the 44th flew in the wake of the main formation; thus the B-24’s were particularly vulnerable because they had no protection from fire power of the main force, and this vulnerability increased when the group had to open its own formation for the attack; but the 44th blanketed the target with incendiaries in spite of the concentrated flak and continuous interceptor attacks it encountered.  Late in Jun 1943, a large detachment moved to North Africa to help facilitate the invasion of Sicily by bombing airfields and marshalling yards in Italy.  The detachment also participated in the famous low-level raid on the Ploesti oil fields on 1 Aug 1943.  The group was awarded a DUC for its part in this raid and its commander, Col Leon Johnson, was awarded the Medal of Honor for his daring and initiative in leading his men into smoke, flame, and alerted fighter and antiaircraft opposition over the target, which already had been bombed in error by another group.  Before returning to England at the end of Aug, the detachment bombed an aircraft factory in Austria and supported ground forces in Sicily.  In Sep, the group struck airfields in Holland and France and convoys in the North Sea.  In addition, in Sep, a detachment was sent to North Africa to support the Salerno operations.  The detachment returned to England in Oct and from Nov 1943 to Apr 1945, the entire group carried out operations against targets in western Europe, concentrating on airfields, oil installations, and marshalling yards.  Took part in the intensive campaign of heavy bombers against the German aircraft industry during Big Week, 20-25 Feb 1944.  Sometimes flew support and interdictory missions.  Struck airfields, railroads, and V-weapon sites in preparation for the Normandy invasion; supported the invasion in Jun 1944 by attacking strong points in the beachhead area and transportation targets behind the front lines.  Aided the Caen offensive and the St Lo breakthrough in Jul.  Dropped food, ammunition, and other supplies to troops engaged in the airborne attack on Holland in Sep.  Helped to check the enemy offensive during the Battle of the Bulge, Dec 1944 - Jan 1945, by striking bridges, tunnels, choke points, rail and road junctions, and communications in the battle area.  Attacked airfields and transportation in support of the advance into Germany, and flew a re-supply mission during the airborne assault across the Rhine in Mar 1945.  Flew last combat mission on 25 Apr 1945.  Re-turned to the US in Jun 1945.  Re-designated 44th Bombardment Group (Very Heavy) in Aug 1945.  Trained with B-29’s.  Assigned to Strategic Air Command on 21 Mar 1946.  Inactivated on 12 Jul 1946.\r\n\r\nActivated on 1 Jul 1947.  Assigned to Strategic Air Command.  Not manned during 1947 and 1948.  Inactivated on 6 Sep 1948.\r\n\r\nRe-designated 44th Bombardment Group (Medium).  Activated on 2 Jan 1951.  Assigned to Strategic Air Command and equipped with B—29’s.  Inactivated on 16 Jun 1952.\r\n\r\n \r\n\r\nSquadrons & Squadron  Dates \r\n66th 1941 - 1946; 1947 - 1948; 1951 - 1952 \r\n67th 1941 - 1946; 1947 - 1948; 1951 - 1952 \r\n68th 1941 - 1946; 1947 - 1948; 1951 – 1952 \r\n404th 1942 \r\n406th 1943 - 1946 \r\n\r\nStations & Stations Dates \r\nMacDill Field, Fl 15 Jan 1941 \r\nBarksdale Field, La Feb 1942 \r\nWill Rogers Field, Ok Jul 28 - Aug 1942 \r\nShipham, England Oct 1942 - 15 Jun 1945 \r\nSioux Falls AAF, SD 27 Jun 1945 \r\nGreat Bend AAF, Ka 25 Jul 1945 \r\nSmoky Hill AAF, Ka 14 Dec 1945 - 12 Jul 1946 \r\nAndrews Field, Md 1 Jul 1947 - 6 Sep 1948 \r\nMarch AFB, Ca 2 Jan 1951 \r\nLake Charles AFB, La 1 Aug 1951 - 16 Jun 1952 \r\n\r\nCommanders & Dates\r\nLt Col Melvin B Asp 15 Jan 1941 \r\nLt Col Hugo P Rush May 1941 \r\nCol F H Robinson 1 Apr 1942 \r\nCol Leon W Johnson 15 Jan 1943 \r\nLt Col James T Posey 3 Sep 1943 \r\nCol Frederick R Dent Dec 1943 \r\nCol John H Gibson 1 Apr 1944 \r\nCol Eugene H Snavely Aug 1944 \r\nCol Vernon C Smith Apr 1945 – \r\nLt Col Henry C Coles 6 Aug 1945 \r\nCol William J Cain Jr 30 Aug 1945 \r\nLt Col James F Starkey 8 Jan 1946 – \r\nUnknown 1947 – 1948 \r\nCol Howell M Estes Jr Feb 1951 \r\nCol Carlos J Cochrane 7 Mar 1951- 16 Jun 1952\r\n \r\n\r\nCampaigns:\r\nAntisubmarine, American Theater ; Air Combat,  EAME Theater;  Air Offensive, Europe ;  Sicily ; Naples-Foggia ; Normandy ; Northern France; Rhineland ; Ardennes-Alsace ;  Central Europe. \r\n\r\nDecorations:\r\nDistinguished Unit Citations: Kiel, Germany, 14 May 1943; Ploesti, Rumania, 1 Aug 1943\r\n\r\nInsigne:\r\nShield: Azure, a bomb, point downward, between eight stars, four and four, or, all bendwise. \r\n\r\nMotto: \r\nAGGRESSOR BEWARE.  (Approved 15 May 1951.) \r\n\r\n                          \r\n                                                                 * * * * * * * * * * * * * * * * * * \r\n\r\n\r\n                                                      Veterans Remember Fallen Comrades\r\n\r\n                                                                         COLIN CHINERY\r\n\r\nNovember 7, 2001 21:23\r\n\r\nThree hundred American veterans of the air war against Hitler's Germany today paid tribute, along with the people of Norfolk, to the memory of their fallen comrades in two Norwich civic ceremonies, over watched by major security operations.\r\n\r\nFormer members of the USAAF 2nd Air Division, which lost 6700 crew members in bombing missions from airfields in Norfolk and north Suffolk, were here for the official opening and dedication of the new 2nd Air Division Memorial Library in the Forum. No one doubts it will the last such visit. \r\n\r\nAnd as they gathered, and with Prime Minister Tony Blair flying into Washington for talks with President George Bush, the second world war veterans were reminded that American and British servicemen are once again allies in armed struggle.\r\n\r\nIn his address Major General Kenneth A Hess, commander of the 3rd Air Force based at Mildenhall, deputising for the US Ambassador, said:\r\n\r\n\"Today's skies are once again a place of battle and our world again clouded with fear. Once again young American airmen and women are flying side by side with our truest ally, the United Kingdom.\"\r\n\r\nIt was a theme taken up earlier at a service of thanksgiving and remembrance at the Cathedral by the Bishop of Norwich, the Rt. Rev. Graham James, who said: \"This time the enemy is of a  strange and shadowy kind compared with the one that brought so many Americans to Norfolk nearly 60 years ago. But the anxieties of the present lend an even keener awareness to our consciousness of the past. \"There is no better time to remember those who fought from airfields here and to honour the cause for which so many died.\" \r\n\r\nThe opening of the Memorial Library - twice the size of the one lost in the fire that destroyed the Norwich Central Library seven years ago, and the only one of its kind in the world - was the climax of a week of local reunions and commemorations. \r\n\r\n\"We've had the most wonderful hospitality imaginable,\" said one veteran, \"another wonderful welcome in what many of us regard as our second home.\""
  }
]