[
  {
    "suppLineId": 1,
    "perIdentification": 21152,
    "suppRank": "Staff Sergeant",
    "suppUnit": "Ground Crew",
    "suppDuties": "Assistant Crew Chief - Assistant Engineering Inspector  - - -  Per orders dated January 10, 1944: Assigned To Crew #3 \"A\" Flight ; A/C #41-29231"
  },
  {
    "suppLineId": 2,
    "perIdentification": 0,
    "suppRank": null,
    "suppUnit": "Weather Squadron",
    "suppDuties": "December 1944 Reporting\r\nWeather\r\n\r\nThe 44th BG is serviced by personnel of one of the many 18th Weather Squadron Departments who are under the direct control of the regional control office of the 18th Weather Squadron.\r\n\r\nActually, 18th Weather Squadron operates as three distinct and independent organizations, each under the supervision of one of the three air divisions with each bombardment group of each division serviced by a weather detachment.\r\n\r\nAll weather sections are commanded by a station weather officer and an assistant station weather officer who are responsible to 2nd Air Division for efficient operations.  usually each group has a group weather officer who is responsible to his group for necessary weather information.  It has been the policy of this station as far as commissioned officers are concerned, to assume equal and full forecasting duties.\r\n\r\nWorking with three officers are two enlisted forecasters and six observers, one of the six being assigned to the group, whose duty it is to observe and do clerical work for the group weather officer.  This is necessary in the event the group is suddenly ordered to another location where weather personnel may be limited.\r\n\r\nThe section operates efficiently at normal strength, although at present is operating below the table of organization.\r\n\r\nIt is our aim to provide the group with the most accurate weather information and forecasts, both operational and non-operational.  Our forecasting for operational is officially limited to local forecasts.  It is the responsibility of this section to get our ships to the division assembly line at the proper altitude and time, and back to base.  Otherwise, the route and target forecasts are prepared by 8th Air Force and identical forecasts are furnished to all participating forces.  As far as non-operational flying is concerned, we are entirely responsible for our ships and attempt to have them in the air at every available opportunity.\r\n\r\nOur part in operations, as viewed by pilots, is very important.  Not only do they face all problems of combat flying, but fight the weather either at takeoff, along the route, or at the base upon return.  At briefing, every aspect of weather, considered important for a successful mission, is attacked and stressed.  Cloud bases, cloud tops, cloud amounts, contrail levels, and conditions, temperatures and winds are forecasted to our best available knowledge.\r\n\r\nWhen our ships have returned to base, all crewmembers are interrogated and an actual picture of weather conditions encountered is determined.  This is then summarized with summaries or the other wing situations and later summarized with the other three combat wings.  After the three divisions have summarized, the final summary is presented to 8th AF for confirmation of the forecast and meteorological study.\r\n\r\nThis detachment is one of the oldest weather stations in the 8th Air Force and has trained and supplied many weather officers, forecasters, and observers of the succeeding stations of the 2nd Air Division.\r\nFrom the 18th Weather Squadron History Station 115\r\nShipdham, England\r\n\r\nThe pioneer staff was augmented by the arrival of Sgt. R. G. Johnson in November and Lt. A. M. Hutchinson in December (1942).  The latter's career was destined to be brief but memorable.  Exactly two months after his arrival he volunteered for a mission.  Through a rated navigator, he was not an air crew member, but on 16 February 1943, he volunteered to replace the regularly assigned navigator who was unable to participate, thus making it possible for that ship to take part in the mission.  Soon after leaving the English Coast his ship was seen in a mid-air collision with another of the same formation.  Both ships exploded and fell in flaming pieces.  His complete disregard for personal safety on this occasion in face of hazardous duty elicited a citation from Maj. Gen. J. P. Hodges, Commander of the Second Air Division.\"\r\n\r\n\"Lt. R. F. Long, who had come here in April, 1943, went to Africa in September to be attached to the weather advisory group for the Italian campaign.  Concurrent with his departure, Lt. C. L. Farris arrived and subsequently became Station Weather Officer.\"\r\n\r\nMissing in Action\r\nShipdham\r\n\r\nThe original cadre here lost no time getting settled for the base was in full operation when they arrived October 26, 1942.  To Lt. N. C. Hero, T/Sgts. G. C. Ellis and D. O. Myers, S/Sgt. J. A. Richardson, Cpls. M. P. Hrtig, Max Miller, Osborne Richards and T. C. L. Berry, Pfcs. J. R. Cuffia and F. A. Wild the Liberators on the line looked mighty good.  It meant getting right to work with none of that all too familiar \"sweating out\" the arrivals of flying personnel.  The period of scrounging, cleaning, painting and building passed quickly and a fair facsimile of a weather station emerged from what had been bare walls and debris when the Group arrived.\r\n\r\nThe pioneer staff was augmented by the arrival of Sgt. R. G. Johnson in November and Lt. A. M. Hutchinson in December.  The latter's career was destined to be brief but memorable.  Exactly two months after his arrival he volunteered for a mission.  Though a rated navigator, he was not an aircrew member, but on February 16, 1943, he volunteered to replace the regularly assigned navigator who was unable to participate, thus making it possible for that ship to take part in the mission.  Soon after leaving the English Coast his ship was seen in mid-air collision with another of the same formation.  Both ships exploded and fell in flaming pieces.  His complete disregard for personal safety on this occasion, in the face of hazardous duty, elicited a citation from Major Gen. J. P. Hodges, commander of the Second Air Division.\r\n\r\nPersonnel turnover was exceptionally high in the early part of 1943.  In June Captain Hero departed for temporary duty in North Africa, serving as a Staff Weather Officer in connection with the original Ploesti raid.\r\n\r\n0434\r\n\r\nLt. R. F. Long, who had come here in April 1943, went to Africa in September to be attached to the weather advisory group for the Italian campaign.  Concurrent with his departure, Lt. C. L. Farris arrived and subsequently became Station Weather Officer.  Others were to follow him at intervals, each contributing something to the efficiency of a smoothly functioning station.\r\n\r\nBombs - Real and Otherwise\r\n\r\nThree weathermen saw the first (and at this writing the only) bomb to strike this field.  Cpl. W. L. Barkdull was taking an observation when he became interested in watching the air raid then in progress, with searchlights sweeping the sky.  The Flying Control Officer, following the plotted course of the planes, shouted, \"There's one coming our way.\"  The roar increased.  The plane dived through the overcast, there was a frightful noise, like compressed air being blown through a giant flame, and then the missile hit.  Demonstrating his absorption of training Barkdull watched, with open mouth s it hit, puffed, and sent up a brilliant flame.  He dashed back into the station only to pop out again to see what was going on.  Sgts. R. H. Breitenfield and l. G. Becquart, coming down the road when the roar started, viewed the spectacle, Breitenfield from what Becquart describes as a self-made slit trench.\r\n\r\nAnother \"bomb\" scare came when a sergeant of the guard burst in one night to report that something had just dropped by parachute, trying the nerves of a guard nearby to the utmost as he shouted for the sergeant.  The to had crept toward it until they could read, \"Sensitive Meteorological Instrument,\" and then the sergeant had dashed to the weather station.  It sounded like a radio sound instrument, but there's nothing like being sure, so the instrument was turned over to S-2, left on the desk of an absent major to whom it gave no small shock the next morning in the minute or two it took him to turn it over to ordnance, which put in a hurry-up call to the weather station where it was reidentified as harmless.\r\n\r\n0436\r\n\r\nCpl. Breitenfield was the first man at the station, arriving 23 August 1943.  Sgts. Walter Pollock, A. J. Olson and D. W. Arnold and Cpls. L. G. Becquart and Leon Brock followed.  Capt. J. N. McFadden, weather officer for the group, came next, then M/Sgt. D. O. Myers, station chief and Lt. J. R. Borchert, station weather officer, the station beginning operations 9 September.  At his own request, Capt. McFadden became assistant operations officer of the group.  Lt. Borchert and M/Sgt. Myers were assistant weather officers, Lt. Gholson leaving later and Lts. G. A. Guy Jr. and G. T. McClelland moving in.  Lt. Borchert left in December and was succeeded by Lt. Folkert."
  },
  {
    "suppLineId": 3,
    "perIdentification": 0,
    "suppRank": null,
    "suppUnit": "Quartermaster",
    "suppDuties": "                                                              Q U A R T E R M A S T E R\r\n\r\n\r\nINTRODUCTION - The Quartermaster Corps organization assigned to Army Air Forces Station #115, is designated as 1132nd Quartermaster Company Service Group Aviation (RS) and operates under T/O and E 10-437 (RS).  The Quartermaster company performs all quartermaster functions on this station.  The Station Commander designates on Special Orders a Station Quartermaster who is the senior quartermaster officer present.  It is the function of the Station Quartermaster to provide for procurement, storage, and issuance of and maintenance of adequate records for all Quartermaster property and supplies authorized and required by the station or unit organizations located on this station.\r\n\r\nGENERAL ORGANIZATION - 1132nd Quartermaster Company Service Group Aviation is authorized three officers and 55 EM.  On 31 January 1945 the company strength was three officers, one of which is on Detached Service, and 48 EM.  Enlisted men strength has never reached the total authorized strength since arrival of the company at this station.  On an average, the under-strength has been approximately five men during the entire 16 months in this theatre.  During the winter and during rush seasons when necessary, details are provided by the Station Commander to augment Quartermaster Personnel.  Quartermaster is located on the Tech Site and at present is housed in a building located east of Station Headquarters, directly opposite Station Motor Pool.  Outside entrance, Door #3 leads to Station Quartermaster main office, General Offices and Company Orderly Room.  Door #4 is entrance to ration room and warehouse where Class 1 supply is located.  Class II and IV supply warehouse and office is located at Door #6.  Post Camp and Station Property warehouse and office is located at Door #7.\r\n\r\nCLASS I SUPPLY SECTION - Class I supply is the important part of Quartermaster to Army and Air Forces.  It supplies all rations and ration accessories which are consumed at an approximate daily rate, irrespective of combat operations.\r\n\r\nThis section is supervised by a Quartermaster Officer designated as subsistence officer and operated by seven enlisted men, one of whom is in charge of Section Chief.\r\n\r\nRations are issued on the basis of \"Ration Return\" OCQM form No. 4, which is prepared daily to show the personnel strength for the Station and strength anticipation three days in advance.  This form is submitted to the serving depots through command channels.  Perishable rations are allocated and received daily at the Class I warehouse where they are checked, broken down and distributed to mess halls.  There are six mess halls on this station which are furnished rations.  Transportation for delivery of Class I supplies to station distribution points is furnished by the serving depot and transportation furnished by the station makes deliveries to the mess halls.  Among personnel in Class I there are two men qualified as drivers who are in charge of the vehicle used to deliver rations.  Besides the daily issue of perishable rations, a weekly issue is made of dry rations which includes all items of a staple nature.  These rations are received all of one day each week which at present happens to be on Thursday.  The day following delivery is devoted to breaking down and making distribution of dry rations to the mess halls.  Early each Thursday morning the ration truck and the two men make a trip to the depot for purpose of checking dry rations at the time of loading.  Heavy, bulky items are loaded on the station ration truck and brought back ready for delivery direct to mess halls.  This saves extra handling of unloading and loading items such as sugar and flour.  Bread is an item requiring daily pick up, except Sundays from the field bakery assigned to this base.  The handling of bread requires the use of the ration truck and two men for approximately half a day for making pick up and delivery.\r\n\r\nThe present Class I warehouse is not adequately suited for loading and unloading of trucks due to lack of a loading platform.  Lifting canned goods cases was formerly a backbreaking drudgery until a conveyer system was devised by \"borrowing\" some sections of a conveyer platform.  This has greatly facilitated the handling of rations as well as reduced the time delivery trucks are tied up awaiting unloading.\r\n\r\nCLASS II & IV SUPPLY SECTION - This section operates under direction of the main Quartermaster office with the Station Quartermaster and Chief Clerk in charge of proper functioning.  A staff of five EM and including a section chief is used to operate this section.\r\n\r\nClass II Quartermaster supplies are items of (1) individual and organizational clothing and equipment, allowances of which are covered by tables of equipment and tables of allowances.  Some examples of clothing would include blouse, trousers, overcoats, socks, and shoes and examples of equipment are blankets, web equipment, etc.  (2) Expendable supplies covered by specified authorized allowances which would include stationery, office supplies, cleaning and preserving materials and equipment.  (3) Maintenance and repair parts for the above mentioned Class II items.\r\n\r\nClass IV Quartermaster supplies are those articles required for non-recurring operation and other special projects.\r\n\r\nRequisitions for Class II and IV Quartermaster supplies originates in the individual unit supply room.  All requisitions are received in the main Quartermaster offices where they are checked to make sure items requested are authorized and make sure the certification apply properly to the items requested.  Requisitions are then turned over to the requisitions for all like articles required for the station during a certain period.  Consolidated requisitions are authenticated by a Station S-4 Officer and by the Station Quartermaster Officer.  After this procedure has been completed, requisitions are sent to the assigned depots for action and issue.  The depots designate drawing days for the stations served by them and on the designated day representatives from Class II go to the depot for the clothing and equipment approved for issue.  In recent months certain clothing items have been hard to secure, thus requiring initiative of the part of those going to the depot to try to get as many substitutions as possible where items are not approved because requested sixes are not available.  Clothing and equipment secured from depots are processed in the warehouse and issued to the organization submitting requisitions.  Requisition clerk maintains an active follow-up system on all requisitions submitted to depots and make sure proper attention is given each one within a reasonable length of time.\r\n\r\nTwice each month salvage clothing and equipment is turned in by unit personnel to their supply room and delivered to the Class II warehouse.  These articles must be checked in at the time of arrival and consolidated in bundles of each item.  A consolidated turn-in and issue form is prepared and taken with the material to the depot for reissue.\r\n\r\nPeriodically, MIA clothing and equipment is turned in by unit supply rooms for return to depots.  This requires a processing procedure similar to that used for salvage items turned in and then it is transported to the depot.\r\n\r\nOffice supplies, stationery, cleaning and preserving materials are stocked in Class II warehouse in quantities allowed by the Table of Allowances and availability of the items needed.  These are issued to the using organizations upon demand in quantities proportionate to the organization's authorized allowances and stock of items available."
  },
  {
    "suppLineId": 4,
    "perIdentification": 0,
    "suppRank": null,
    "suppUnit": "Ordnance",
    "suppDuties": "                                               1646 ORDNANCE SUPPLY AND MAINTENANCE\r\n\r\nThe functions of the 1646 Ordnance Sup. & Maint. Co. (AVN) are many and are so much an integral part of the Operating Procedure of the 44th Bombardment Group that the exact importance of what this unit contributes toward the operation of the Group is often not recognized.\r\n\r\nTo properly make the importance of these functions clear, a simple interpretation of Ordnance must be given.  Ordnance embraces the design, procurement, and supply and maintenance of bombs, fuses, ammunition, pyrotechnics, guns and vehicles, etc.  The wide range of work necessitates trained specialists of all kinds.  Normally, whole ordnance companies are made up of men specializing in the type of work, i.e., ammunition companies, artillery maintenance companies, automotive maintenance companies, etc.  A heavy bomber group requires Ordnance men with skills including ammunition, armament, automotive repair, and supply.  Formerly there was an ammunition company and a _______ ? Maintenance Company attached, attached to this group.  This was later changed when a new organization developed, combining the necessary men with the various skills and designated as Ordnance, Supply and Maintenance Company, strength 4 EM, 4 officers.  The nature and extent of the work of the various sections is outlined below:  (Rather difficult to read).  Copied from microfilm."
  },
  {
    "suppLineId": 5,
    "perIdentification": 0,
    "suppRank": null,
    "suppUnit": "Medical Detachment",
    "suppDuties": "                                                         MEDICAL DEPARTMENT DATA\r\n\r\n1.By way of introduction, the Station Sick Quarters is established and conducted in the following manner:  1.  Ward Service (combined medical and surgical); 2.  Venereal Disease; 3. Sick Call; 4. Dispensary and Out Patient Service; 5. Physical Examining Section; 6. Dental Department; 7. Laboratory; 8. Supply; 9. Transportation; 10. Administration.  Officers and enlisted men are assigned to each of the above-mentioned sections for their proper functioning.  All the departments are under the supervision of the Station Surgeon.\r\n\r\n2.The following statistical analysis represents, in general, the medical care given to members of this command both at the Sick Quarters and in Hospitals during the period 1 Jan 44 - 30 June 44:\r\n\r\n                                                                                                    Dis.          Inj.          WIA\r\nAdmissions to Quarters                                                                   549           80            22\r\nTransfer from SSQ to Hospitals                                                          71          12              9\r\nDirect admissions to Hospitals                                                         253           42            59\r\nKilled in action                                                                                 31\r\n\r\n3.The September statistical analysis as follows:\r\n\r\nAdmissions to Quarters                                                                     61            9               1\r\nTransfer from SSQ                                                                             2            2               0\r\nDirect admissions                                                                             32           11              6\r\nKilled in action                                                                                  0\r\n\r\n4.The problem of the care and evacuation of battle casualties is very satisfactory.  First aid and shock treatment is given to the injured at the Sick Quarters.  The cases are then evacuated to the 231st Sta. Hops. which is located at a very reasonable distance from this station.  (I think at Wymondham).\r\n\r\n5.The flak suit and flak helmet have proven to be of immense value as an almost certain protection against missiles of low velocity.  Serious injury and in a number of cases probable death were warded off by the wearing of body armor.  An analysis of wounds incurred by combat crewman shows that protective personal armor was the means in saving the lives of four men and possibly eight, and that serious injury was averted in four additional cases.  As shown by the figures in our statistics, flak was the greatest offender in contributing toward the number of our battle casualties.\r\n\r\n6.Field medical service as such for battle casualties returning form operational missions is given along the following lines.  Wounds are carefully diagnosed before men are removed from aircraft.  Where indicated, immediate first aid is given men on the spot.  Control of hemorrhage and prevention of shock are the primary factors for consideration.  In all instances, casualties which occurred during the period covered by this report were treated for shock in the accident reception and shock room of this Sick Quarters.  Routine treatment of battle casualties at the Sick Quarters may be  listed as follows:  Control of hemorrhage, treatment of shock, prevention of shock, removal of readily accessible foreign matter from wounds, and dressing of wounds.  Definite measures are then taken for the comfort and safety of the individual while he is enroute to the 231st Station Hospital."
  },
  {
    "suppLineId": 6,
    "perIdentification": 0,
    "suppRank": null,
    "suppUnit": "Chemical Co.",
    "suppDuties": " \r\nUnit History, 806th Chemical Co (AO), from the time of activation, 25 May 1942 to 25 July 1944\r\n\r\n 1.The present Company known as the 806th Chemical Co (AO), was activated at Hunter Field, Savanna, Georgia, the 25 May 1942.  This new Unit was reactivated from the 2d Platoon, 3rd Chemical Co which came to Hunter Field from Will Rogers Field, Okla. Lt. Col. Clarence H. Breedlove, 8th Air Force Chemical Officer, a former Company Commander of the 3rd Chemical Co., has shown a keen interest in the activities of the 806th Chemical Co. since its arrival in the ETOUSA under his higher command.  2d Lt. Joseph J. Casey was the first Company Commander of the newly formed 806th Chemical Co.  The authorized strength of the Unit being 3 officers and 135 enlisted men.  A General Order the 7 July 1942 made effective the transfer of the 806th Chemical Co. from the 3rd Air Force to Air Force Command.\r\n\r\n2.The Company remained at Hunter Field until the latter part of April 1943.  The Company Commanders following Lt. Casey in their respective order were:  1st Lt. Ralph Pendexter Jr., 2d Lt. Carl M. Edelblut, 2d Lt. Harry M. Taillie, and 2d Lt. Bryant J. Shaw.  Here the Company performed 27 practice missions in loading MLO spray tanks with chemicals and was the first unit to experiment in the loading of chemicals on he wings of the A36 Dive Bomber, 2d Lt. Roxie J. Marotta, 2d Lt. Michael V. Levonas, and 2d Lt. Bryant J. Shaw joined the 4 January 1943, 2d Lt. Bernard J. Wolfe joined the 25 April 1943.\r\n\r\n3.The company departed from Hunter Field, Georgia, the 25 April 1943, under the command of 2d Lt. Bryant J. Shaw and arrived at Camp Shanks, New York, the next day.  Here the company was processed for overseas duty and placed on shipping alert the 2 May 1943.  The 4 May 1943 the Company entrained for Union City, where they were ferried across the Hudson River on the boat \"Niagra\" to the liner \"Queen Elizabeth.\"  The Company boarded the \"Elizabeth\" about 1900 hours the 5 May 1943.  The ship departed the next morning, 6 May 1943, bound for Scotland via the Northern Route.\r\n\r\n4.The following four officers and 126 enlisted men made up the company loading list upon embarkation.\r\n\r\n2d Lt. Bryant J. Shaw                              2d Lt. Roxie J. Marotta\r\n2d Lt. Bernard J. Wolfe                           2d Lt. Michael V. Levenas\r\n\r\nF/Sgt. Bryce G. Sloan                             S/Sgt. Marion B. Bishop\r\nS/Sgt. Donald R. Hixon                           Sgt. Travis F. Beeno\r\nTec 4 Joseph A. Gurski                           Tec 5 James E. Gilbert\r\nTec 5 Robert J. Ogea                              PFC Valerie J. Brock\r\nPFC Felton J. Hebert                               PFC Huff, James F.\r\nPvt. Clarence H. Griffin                           Pvt. Curtis A. Leslie\r\nPvt. R. J. Lampkin                                  Pvt. Carter J. Rader\r\n\r\nT/Sgt. Charlie L. Reynolds                      S/Sgt. Jack W. Fath\r\nS/Sgt. Alvin H. Hafner                            S/Sgt. Edward F. Krider\r\nS/Sgt. Doyle V. Sharrett                          Sgt. Fred W. Wesley\r\nTec 4 Eugene C. Hageman                      Tec 4 Laurence Waid\r\nCpl Walter J. Hunter Jr.                           Cpl. Russell A. Knight\r\nCpl. Rugo E. Negri                                  Cpl. Alfred L. Nicks\r\nCpl. Homer V. Pool                                  Cpl. Thomas R. Ruddy\r\nCpl. Nicholas H. Selvey                           Cpl. Elmer R. Thurman\r\nCpl. Charles L. Wind                                Tec 5 Abram L. Ardis Jr.\r\nTec 5 Ralph L. Darrett                             Tec 5 Darrell F. Byrd\r\nTec 5 Edward J. Carney                           Tec 5 Rayford A. Collier\r\nTec 5 Russell W. Cooley                          Tec 5 Louis Degiovanni\r\nTec 5 James L. Flint                                 Tec 5 Anthony F. Grande\r\nTec 5 Tom A. L. Griffin                             Tec 5 Harry C. Harper\r\nTec 5 John G. Harris                                Tec 5 Charles V. Hawkins\r\nTec 5 Raymond M. Higgins                       Tec 5 Howard D. Johnston\r\nTec 5 Benjaman L. Jones                          Tec 5 Angelo J. LaGreca\r\nTec 5 Joseph D. Livingstone                     Tec 5 Everett L. Lord\r\nTec 5 John N. MacLean                            Tec 5 Carnie B. Meadows\r\nTec 5 George W. Miller                             Tec 5 Quinton L. Needham\r\nTec 5 Francis W. Overacker                      Tec 5 Faustino R. Pereida\r\nTec 5 Paris H. G. Ruth                              Tec 5 Joseph St. Pierre\r\nTec 5 Lawrence F. Theil                            Tec 5 George Vanderhye\r\nTec 5 Orval J. Walsh                                 PFC Nicholas C. Altieri\r\nPFC Vinzenz I. Bauer                                 PFC Vincent J. Bucnanno\r\nPFC Levi D. Coble                                     PFC Leonard L. Cordin\r\nPFC Paul J. Day                                        PFC\tJohn A. Downing\r\nPFC Raymond Dryer                                   PFC Emile E. Edwards\r\nPFC Leonard J. Cove                                 PFC Grover C. Gross\r\nPFC Arthur G. Ingwartsen                           PFC Dewey T. McCurry\r\nPFC Willie J. Miller                                    PFC Conway A. Morris\r\nPFC Albert Nichols                                    PFC Robert Ortis\r\nPFC Edward Pitch                                     PFC Adam X. Schray\r\nPFC Finlay A. VanScyoc                            PFC Allen J. West\r\nPFC Howard A. Youngs                             PFC Frank J. Zyclowski\r\nPvt  Harold E. Blaine                                Pvt. Norman A. Chaput\r\nPvt Adrian J. Cormier                                Pvt Michael DeMarco\r\nPvt Antonio DiGregorio                             Pvt James A. Denlin\r\nPvt William J. Flynn                                  Pvt Joseph W. Fox\r\nPvt Joseph E. Furey                                 Pvt Kenneth E. Hall\r\nPvt Louie E. Hamilton                               Pvt Leland E. Harrop\r\nPvt Francis Hart                                       Pvt Robert C. Holland\r\nPvt Stanley V. Kolek                                 Pvt Anthony W. Kozlowaki\r\nPvt Chester M. Kraus                                Pvt Durwood F. Layton\r\nPvt Hubert C. Long                                   Pvt Donald C. MacCracken\r\nPvt Harvey F. Mann                                  Pvt Ronald G. McNeeley\r\nPvt Robert L. McPhai                                Pvt Milton Metkoff\r\nPvt Mike Micklo                                        Pvt Jesse E. Minor\r\nPvt Robert E. Moran                                  Pvt Stanley Mrowka\r\nPvt Charles F. O'Brian                               Pvt Eugene W. O'Neill\r\nPvt Rocco Paolillo                                    Pvt Alexander J. Hanco\r\nPvt Joseph Salvucci                                 Pvt Edward P. Seymour\r\nPvt Robert W. Smit                                   Pvt Robert L. Snyder\r\nPvt John C. Stratton                                 Pvt Ferdinand A. Wilder\r\nPvt Dillman W. Williams                            Pvt John R. Wright\r\nPvt Billie G. Young                                   Pvt Sol Lehman\r\n\r\n5. Aboard ship the Company was quartered on \"C\" deck, midship, and ate in \"A\" mess hall on \"C\" deck.  The Company participated in boat drill and performed various details.  The \"Queen Elizabeth\" dropped anchor in the Firth of Clyde on Tuesday, 11 May 1943 at 100 hours opposite Greenock, Scotland.  The company remained on board until 2000 hours the same day, at which time transferred to a lighter and were ferried up the Firth of Clyde to the town of Covena.  Here, the Company boarded a London and North Eastern Railway troop train to Wymondham, Norfolk, England, via Glasgow, Edinburgh, Newcastle, and Ely.  The Company left the train at 1530 hours, Wednesday, 12 May 1943, and proceeded to the Hethel Airdrome, AAF Sta 114, by truck.  Here, the company was unassigned and performed various details and received instructions in loading incendiary clusters.\r\n\r\n6. The 22 May 1943 Detachment \"A\" of the 806th Chemical Co (AO) was formed when Lt. Roxie J. Marotta and 52 enlisted men proceeded to Hardwick, AAF Sta 104.  The same day Lt. Bryant J. Shaw assisted by Lt. Bernard J. Wolfe together with 74 enlisted men departed for Shipdham, AAF Sta 115, at which Station the Company was attached for duty.  At this time the Shipdham and Hardwick-Airdromes were the only two Stations in the 2d Bombardment Wing.  The 806th Chemical Co (AO) was the third complete Chemical Company to arrive in the ETOUSA.\r\n\r\n7. 1st Lt. Edward H. Price joined the Company and assumed Command the 3 July 1943, Lt. Roxie J. Marotta with Detachment \"A\" rejoined the Company at Shipdham in June 1943.  Lt. Marotta and Detachment \"A\" were then assigned to Wendling Airdrome, AAF Sta 118, for duty in July 1943.  Lt. Marotta left Detachment \"A\" to return to the Company at Shipdham and assumed command the 7 December 1943.  Lt. Oliver W. Rusling assumed Command of Detachment \"A\" at Wendling.  Capt. Marotta was promoted form Lt. the 15 March 1944.\r\n\r\n8. Prior to the Forty-Fourth Bombardment Group operations in North Africa which culminated with the \"Ploesti Raid,\" the 806th Chemical Company at Shipdham and Detachment \"A\" at Wendling underwent extensive training in the loading of Incendiary Bombs.  Experiments were made with bending wire and later the present \"Toggle Sling\" method was adopted.  The Company made banding wire in preparation for use on the Ploesti Mission and although circumstances in Africa altered this plan, nevertheless felt an immediate participation in this historical event.\r\n\r\n9. Detachment \"A,\" 806th Chemical Co (AO), operating in conjunction with the 392d Bombardment Group at AAF Sta 118, Wendling, was the first Unit to load a mission-bound B24 Bomber Group with 52 of the M47 incendiary bombs per ship.  The loading of 56 M47 incendiary bombs per B24 was also first used at this base.  Lt. J. S. Brower developed and perfected the \"Bombs-Away\" Indicator JSB.  This Indicator was used on a mission the 5 February 1944 and proved most successful.  Since that date the JSB Indicator has completely replaced the Sky-Marker GHB at AAF Sta 118.\r\n\r\n10. The procedure adopted in the handling of M47 and JSB incendiary bombs has established a precedent, which has been followed by other organizations.  The following five Chemical Units together with their Detachments have received training with the 806th Chemical Co (AO), in preparation for future operations.  They are the 885th Chemical Co. located at Hardwick, the 874th Chemical Co at Hethel, the 858th Chemical Co. at Horsham, the 882d Chemical Co. at Atlebridge, and the 867th Chemical Co at Metfield.\r\n\r\n11. As a Unit of the 44th Bombardment Group this organization including Detachment \"A,\" 806th Chemical Co (AO), at Wendling have received, stored, and disposed incendiary bombs for missions over enemy territory.  Total weight of bombs thus expended on the enemy from November 1943 to July 1944 has been 2,502 tons.  The following chart shows the type of bomb loaded, the target hit, and the date of the mission.\r\n  3 Nov 1943  Wilhelmshaven              M47                                             5 Nov 43  Munster                        M50\r\n13 Nov 1943  Breman                         M50                                           26 Nov 43  Breman                         M47\r\n  1 Dec 1943  Sooingen                      M47                                           13 Dec 43  Kiel                              M50\r\n16 Dec 1943  Breman                         M47                                           20 Dec 43  Breman                         M47\r\n30 Dec 1943  Ludwigshafen                M47                                           31 Dec 43  St. Jean D. Angely A.D.  M47\r\n  4 Jan    44   Kiel                              M50                                             5 Jan  44  Kiel                              M50\r\n 29 Jan   44   Frankfurt                       M47                                            20 Feb 44  Oschersleban Helms      M47\r\n 24 Feb   44   Gotha                           M47                                             2 Mar 44   Frankfurt                      M47\r\n   8 Mar   44   Berlin                           M47                                            15 Mar 44  Brunswick                     M47\r\n 16 Mar   44   Freidrichshafen             M47                                             22 Mar 44  Berlin                           M47\r\n 23 Mar   44   Bramsche                     M47                                               1 Apr 44  Schaefhausen, Switz      M47\r\n  8 Apr    44   Brunswick                     M47                                             18 Apr 44  Brandenburg                 M47\r\n 22 Apr   44   Hamm MY                      M47                                             29 Apr 44   Berlin                           M47\r\n  7 May   44   Oenabruck                    M47                                             14 May 44  Tutow A. F.                   M47\r\n19 May   44   Brunswick                     M47                                             23 May 44   Avord A D                    M47\r\n18 Jun   44   Luneburg                       M47                                             29 Jun  44   Magdeburg                   M47\r\n  6 Jul    44   Kiel                               M47                                               7 Jul  44   Bernberg                       M47\r\n                                                                                                           12 Jul  44   Munich                         M47\r\n12. 1st Lt. Bernard J. Wolfe was named in a Citation, CO #7, Sta Headquarters, 44th Bombardment Group (H), dated 14 June 1944, of which the following is an extract.\r\n\r\n\"1st Lt. Bernard J. Wolfe is cited for exceptionally meritorious conduct in the performance of extraordinary services as Station Chemical Warfare Service Munitions Officer.  Lt. Wolfe's inventive genius has enabled the development of numerous time saving tools and devices for the handling of Chemical Bombs.  The installation of a filling point for loading and handling of smoke bombs, the creation of tools and operating procedure for preparing bombs has greatly increased the operative speed and efficiency of Lt. Wolfe's section.  Lt. Wolfe has also devised a salvage bomb rack for the training of personnel, and for the display of Chemical Munitions.  Lt. Wolfe's ability to adopt himself and his men to new and difficult situations, and his perspicuity in increasing efficiency reflect great credit upon himself and the Armed Forces of the United States.  Entered military service form Darby, Conn.\"\r\n\r\n13. Up to the present date, the company, activated three years and two months ago, has spent the past 14 months in the United Kingdom.  Originally trained in Chemical Warfare Service, the Company has been primarily engaged in the issuing, storing, and handling of Chemical Munitions which includes Incendiaries, besides assisting Ordnance and Armament in the performance of their duties.\r\n\r\n\r\nRoxie J. Marotta\r\nCapt. C. W. S.\r\nCommanding"
  }
]