[
  {
    "acAircraftNo": "41-28692",
    "misMissionNo": 53,
    "acmPlaneRemarks": "An eye-witness report of a Group aircrew returning from this mission stated: \"(This aircraft) believed to have left formation about (15) minutes after target, making an \"S\" left sum\". Estimated time of this event was at 1500 hours. The mission facts conceming this aircrew and plane were reamed later from their having proceeded southbound after leaving formation and landing safey in neutral Switzerland at Dubendorf field, near Zurich at-1545 hours (according to Swiss logs). All crewmembers were subsequently interned. This crew and ship were the second of three 392nd Group planes which landed in Switzerland on this raid within a short period of time. Enemy reaction damage to the Hebron Crew plane was never stated in the MACR account.\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: All members survived from the plane having landed safefly in Switzerland. After the war, a 'Casualty Questionnaire' was circulated to Pilot Hebron concerning the whereabouts of the Co-Pilot, Lt. McGowen. His reply noted that this crewmember was last seen at Adelboden, Switzerland on 13 April 1944 during internment, and reports were that the Lieutenant had escaped into France sometime after the French Border to Switzerland had been liberated by American Forces. Lt. Hebron's reply on his crewmeber to the U.S. Army Air Force \"AFPPA-8\" dated 23 April 1946 from San Bernardino, California, noted the casualty status of Lt. McGowen to be in error in that the latter had reverted to Allied control; resumed to England; and thence to the United States and separated from the active Service. Sgt. Devoe, another crewmember was queried also on the Co-Pilot's status, and he gave essentially the same report as Pilot Hebron. Devoe's address at that time was 2330 S. Milwaukee, Denver, Colorado.\r\nBURIAL RECORDS: None. This aircrew suffered no casualties as a result of their diversionary landing in a neutral County.\r\nNEXT OF KIN DATA IN WWII: No record exists in this MACR.",
    "acmAircraftPosition": "Lead Element Right Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 9
  },
  {
    "acAircraftNo": "41-28742",
    "misMissionNo": 53,
    "acmPlaneRemarks": "Accounts of this aircrew's loss were very limited in reports from any Group returning aircrews. Major Keilman, Acting Command Pilot and 579th Squadron Commander in the Group lead ship for this mission, did report that flames were seen on the flight deck of Books' aircraft and when last seen this plane appeared to be under control, flying very low and (8) parachutes were seen. In the hectic aftermath of withdrawal by the Group's surviving aircraft after bombing this target where the entire formation had come under fierce, persistent and heavy enemy fighter attacks, the fates of many individual 392nd planes and crews could not be positively determined at the time. Every aircrew, aircraft and individual crew member in the remaining ships were literally fighting for survival in an all-out effort to repulse the many German fighter firing passes in protecting their own aircraft and the other ships in the Group's formation, particularly as they all began the outbound route home immediately after target.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The only survivor of this aircrew's tragic consequences was Staff Sergeant Chester Strickler who was taken as Prisoner-of-War near the plane's crash site. After release from POW status, Sgt. Strickler wrote a lengthy letter to Mrs Morris, a close Family member of the crew's Engineer, Staff Sergeant Morris, who perished in this emergency that mission day. In summary, Sgt Strickler by his correspondence of 29 July 1945 recapped the crew's immediate background as a well-functioning unit and the events of that fateful day: the plane assigned to this aircrew for this mission was a newly acquired B-24 by the 392nd and was flying its first sortie with the Group. The Books' crew promptly nicknamed the new plane, \"OLD GLORY\", just before they took off, and this mission was the 8th one for the entire crew. He related they were shot down about (80) miles northwest of Fredrichshafen on the retum route and the time was around 3:15pm (1515) when the ship blew up. He recalled this time very well just after he hit the ground. No other details in this account dealt directly with the crew's emergency leading up to the final crash. German Report #KU1254, and dated 21 March 1944, gave the general findings about the crashed plane and crewmember status. The final crash site was recorded as being (1500) meters northwest of the Community of Hardt, near Schramberg, County of Rottweil, Germany (Black Forest area), and occurring at 1510 hours. It further noted that (9) bodies had been recovered at the scene, (3) of which were not identifiable due to severe burns. A tenth crewmember had been captured which accounted for all (10) men. The deceased members identified were Books; Morris; Hampton; Gray; Slack and Porter. (The unidentified bodies were those of Slowik, Jones and Willig as later determined inasmuch as Strickler was the captured crew member). This German Report also noted that it had been 'ascertained' that a fighter had downed this aircraft. Another report from German Air Base Headquarters at Echterdingen (air base just south of Stuttgart proper) recorded the finding of three crewmen who had perished, burned and still inside the plane's wreckage. A final German report gave summary details on the enemy capture of Sgt. Strickler in the area of the crash site, and that this prisoner was detained in Rottweil at a \"PW\" Hospital.\r\n\r\nBURIAL RECORDS: The 'Report of Captured Aircraft' rendered by the German air headquarters at Echterdingen also reported the burial of the (9) deceased crewmen on 21 March 1944 in the Cemetery of Hardt, near Schramberg. A review of all U.S. National overseas Cemetery listings records no permanent interment of any of these crewmembers at the present time. (Note: It is surmised that all were recovered and later returned to the States for burial upon request of Families. It is known, however, from Primary Source information, U.S. Army, that Lt. Books remains were recovered and re-buried by U.S. authorities on 5 August 1946 at 1600 hours in Plot fill, Row 8, Grave 89 in the U.S. Military Cemetery at St. Avold, France).\r\n\r\nNEXT OF KIN DATA IN WWII: Information recorded in this MACR is as follows: Books (Father, Oliver, Eau Claire, Wisconsin); Morris (Mother, Beulah of Pine Grove, Pennsylvania); Gray (Wife, Mrs. Harry K., Lindsborg, Kansas); Strickler (Mother, Berkeley, Califomia); Slowik (Father, John, Hartford, Connecticut); Porter (Father, Alolus L., Detroit Lakes, Minnesota); Slack (Mother, Alice, Woburn, Massachusetts); Jones (Mother, Youngstown, Ohio); Willig (Mother, Minnie M. of Salem, Oregon); and Hampton (Mother, Dora S., Chattanooga, Tennesee). Identification tags found on the deceased members - Hampton, Porter and Books - also recorded the next-of-kin and addresses of these men.\r\n\r\n(PRIMARY SOURCE RESEARCH NOTE: A very detailed and comprehensive file of data on this aircrew's final circumstances and fate at the crash site near Hardt, Germany, has been researched and compiled in an in-depth effort by Mr. Everette (Jim) Marsteller of RR #1, Box 254, New Park, Pennsylvania 17352. Mr. Marsteller is the nephew of deceased crewmember, Staff Sergeant Everette Morris, the aircrew's Flight Engineer this tragic day. As an avid historical research individual, Jim Marsteller has returned to the actual crash location and village vicinity where the Books' crew was finally downed and visited with a number of key local residents and authorities on more than one occasion to gather facts, eye-witness accounts, and even photos now of the crash location and ones taken long ago of the actual plane wreckage. Each and all of his investigative efforts to restructure every possible fact and detail regarding this one event, together with close associates who share his quest as well, have been rewarded with unbounded cooperation by the people of Schramberg and the nearby communities in assisting him in every conceivable way. Mr. Marsteller through these searchings has recovered some of the aircraft's metal parts, and his future efforts are dedicated to continuing research visits back to the scene where he shares a dialogue with respondents today living nearby in Germany. His efforts, past, present and for the future's plans, are best held as a true 'labor of love' to preserve some factual measure of the 392nd Bomb Group's combat wartime history through the memory of the Books' crew loss. He is a fully recognized \"primary historical source\" research individual as an Associate Member of the 392nd Bomb Group Memorial Association today).",
    "acmAircraftPosition": "Lead Element Left Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "41-29174",
    "misMissionNo": 53,
    "acmPlaneRemarks": "An eye-witness account from returning aircrew members of the Group stated that the Dalton aircraft had been caught in violent propellor 'wash' and suffered a mid-air collision with another 392nd ship which at the time was falling back out of formation. The report continued to relate that the other plane was that of Lt. Anderson's and this plane had suffered loss of its tail turret and entire tail assembly. The event was noted to have occurred at 1233 hours over France enroute at position 49-34N, 02-16E. All inflight sightings were correct except the Dalton collision was not with the Anderson aircraft, but with that of Lt. Feran's ship in #43-28651. German ground reports later conclusively venfied these two ships by tail number had indeed collided in mid-air. (Note: A reference to Lt. Anderson's fate is accounted for in MACR #03330, as he and his crew went down after target around 1500 hours). The sole survivor of this crew, Sgt. Payne, was helped by the French underground forces, and made a statement later on 4 July 1944 to U.S. European Military Intelligence authorities concerning this mishap. Highlights of his report affirmed some of the details of this mid-air collision. The Dalton ship had a section of the right wing tom off behind #4 engine, and a portion of the tail assembly. The other plane (reran's) had lost its left tail section and also both wings. The collision occurred at 23,000 feet and this crewmember believed that he was the only one of his crew to his knowledge (in the waist section) who was wearing a parachute at the time of this accident. Helpers had told him that (3) Officers of the Dalton crew were found clear of the wreckage and were not wearing their chutes. All of his own crewmembers were identified at the crash site by their ID tags according to his escape and evadee 'helpers'. He stated further that all crewmen on both aircraft had perished according to reports given to him. A review of German ground reports, which were many conceming both downed aircraft and crews, definitely confirmed that the Dalton and Feran planes went down in very close proximity to each other. These reports in more than one instance noted the mixing' of names comprised of both aircrews during recovery of the bodies, and later their initial burials together in the same location. All (19) crewmen (except the lone evadee, Sgt. Payne) of both aircraft were accounted for in enemy accounts. The primary German Reports dealing with these facts were #KU1236, from Headquarters Airfield 5XC1 Mondidier, and #KU1237. This latter report which emanated from a German Air District in Brussels, dated 2 April 1944, summarized all of the salient facts from the downing of these two ships: Investigation Report # 5/2072 on the Dalton ship, #-129174, stated this Liberator had collided with another B-24 (Report # 5/2073) at 1232 hours in mid-air, and had crashed about 800 meters north of Le Pleyren, France, (8) kilometers south of Mondidier. It stated this ship was completely destroyed and bumed after the crash in all probability \"from the incendiary bombs it had been carrying which contained liquid fuel\". All crewmembers were found dead; and no Group identification was discernible except a blue \"D\" in a white circle, and a portion of the rudder fin with an R' below the serial numbers reported.\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The only survivor report was that of Sgt. Payne, a Waist Gunner, as noted above. He also stated that he had seen the other Waist Gunner jump from the plane when he (Payne) left. But, this gunner did not have his parachute on at that time. As for the Tail Gunner, he perished in his turret according to French Underground helpers. No further information about this mishap, during and after, is contained in this MACR.\r\nBURIAL RECORDS: According to German Report #1236, all casualties of this aircrew were interred in a common grave in the Cemetery of Le Pleyren, France, at the eastern outskirts of this village. Three (3) of the Dalton crewmembers were not identifiable by the Germans. These crewmen later turned out to be Lt. Sherman, Lt. Brandes and Sgt. Taylor. A review of U.S. National overseas Cemetery listing note the following crewmen were later recovered and interred as follows: Dalton in the U.S. Military Cemetery at EPINAL (Grave B-25-22), France, which is located (4) miles south of Epinal (\u0001/oges) on the west bank of the Moselle River; Brandes also in EPINAL (Grave A-17-11) and Brown likewise (Grave B-37-51). There are no U.S. overseas Military Cemetery listings on the other airmen of this crew. The possible reburial of these latter members in the States at a later date after the war is not known. For those buried at the EPINAL location, there is note of a Purple Heart award.\r\nNEXT OF KIN DATA IN WWII: The MACR record is not clear on this information except as follows: Dalton (Wife, Mrs of New York State); Storey (Wife, Mrs of West Palm Beach, Florida); Sherman (Wife, Lucille, Los Angeles, California); Brandes (Father, Louis, Sheybogan, Wisconsin); Conley (Mother, Elizabeth H. of New York State); Holmes (Mother, Mrs Phyllis R., State of Kansas); Brown (Mother, Kathy L., Panama City, Florida); Payne (Mother, Lois, Lake Placid, New York); Hildebrand (Mother, Mrs Raymond C., Edgewood, Maryland); and Taylor (Mother, Mrs. Chyda, Cuthbert, Georgia).",
    "acmAircraftPosition": "Low Element Diamond",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 12
  },
  {
    "acAircraftNo": "42-7497",
    "misMissionNo": 53,
    "acmPlaneRemarks": "Eye-witness accounts from returning aircrews stated that this aircraft was last seen at 1510 hours after target at position 48-1 6N, 0741 E. The ship was observed with one outboard engine on fire circling to the left and then spun down and crashed. Four parachutes were seen at once, then three more in a delayed jump sequence, totaling (7) chutes.\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The only individual accounts concerning this aircrew's missing status were those contained in German ground reports on-scene. Seven (7) men from this crew were reported as being taken prisoner by Report #KU1251 which also noted the time of the aircraft crash as 1530 hours near the village of Kinsheim. It was noted that (7) crew members were captured, all positively identified from their dog tags; and (3) others were found dead at the scene: The Pilot Peterson, L.G. and Co-Pilot Lidgard and one other who could not be identified (Note: This body later proved to be that of the Tail Gunner Dinda). From these enemy reports, it was determined that the three dead crewmen were found in the crashed plane which site was pin-pointed as (1) kilometer southwest of Kestenholz/County of Schlettstadt.\r\nBURIAL RECORDS: The enemy reports above reflected that the deceased crewmen were buried on 20 March 1944 at 1445 hours in the community cemetery of Kinsheim. Later, U.S. National overseas Cemetery listings noted the following re-interments: Lidgard in the EPINAL Military Cemetery, France (Grave A-30-3) and Dinda, also at EPINAL (Grave A-14-3). There exists no record of U. Peterson in any U.S. overseas plot which suggests that his body was returned to the States later at Family request. Lidgard is noted to have earned the~Air Medal with (3) Oak Leaf Clusters; and Dinda received an Air Medal with (2) Oak Leaf Clusters. Only Dinda is recorded to have been given a Purple Heart; but not Lidgard.\r\nNEXT OF KIN DATA IN WWII: Information is as follows: Peterson (Father, Edward C., Frederick, South Dakota); Lidgard (Wife, Margaret A., Adrian, Michigan); Long (Mother, Cloe I., Allegan, Michigan); Cannistraro (Father, Dennie, Waltham, Massachusetts); Bellerive (Wife, Genevieve K., Collyer, Kansas); Lawrence (Mother, Ida R., Salem, Virginia); Smith (Wife, Mary F., Webb City, Missouri); Apgar (Sister, Mrs. Emily M. Whalen, Plainfield, New Jersey); Dinda (Mother, Anna E., Newton Falls, Ohio); and Opsahl (Wife, Dorothy K., Lakota, North Dakota).",
    "acmAircraftPosition": "Low Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 2
  },
  {
    "acAircraftNo": "42-7518",
    "misMissionNo": 53,
    "acmPlaneRemarks": "Accounts from returning 392nd crew members indicated this was a plane that did a complete outside loop after being attacked by enemy fighters-then went straight down and crashed. Nine parachutes were reported seen. (Note: In the confusion of a running fire fight with enemy aircraft, chances are this observation might have been mistaken for another Group ship also in trouble since a crew member's report later accounted for only (2) men at most getting out of this stricken aircraft). A German ground report #KU1234 of 21 March 1944 from Air Field Command 6NII at Boeblingen (south west of Stuttgart complex) noted only one crewmember being captured near Rottweil, that being Sgt. Rankin.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: Only one such report is in this MACR and that of Sgt. Rankin after his return to the States and dated 25 February 1946, Lewistown, Pennsylvania. In this account, he stated the plane took a direct hit and exploded as a result of enemy fighter attacks within two minutes after 'bombs away'; that he believed but was not certain that (2) other crewmembers bailed out besides himself, Pvt. Gyure and Sgt. Davis; but that the Germans later had told him that Gyure was found still in the plane where it crashed; and later, the War Department had notified the Wife of Sgt. Davis that he had died in a German Hospital while in POW status.\r\n\r\nBURIAL RECORDS: There are no German records regarding initial interment of any crewmembers. A search of U.S. National overseas Cemetery listings finds the following information regarding U.S. reburials: Raschke in the LORRAINE Cemetery France (Grave B-34-38); Petrozzella, also in LORRAINE (Grave C-28-91); as well as Wagonseller (Grave B-1-26) and Davis (Grave D-9-16); and Krek is interred in the ARDENNES (Grave B-31-3). No other records exists on the recovery and subsequent reburials of the remaining crewmen, German or U.S. overseas locations. Awards noted are: An Air Medal with (1) Oak Leaf Cluster and thePurple Heart for all members except Raschke, who is shown with no Purple Heart citation.\r\n\r\nNEXT OF KIN DATA IN WWII: MACR data is as follows: Raschke (Aunt, Miss Josephine Wirtz, Chicago, Illinois); Holm (Mother, Lola R., Eugene, Oregon); Ward (Sister, Mrs. Pearl L. Buss, Wausau, Wisconsin); Petrozzella (Father, Joseph, Brooklyn, New York); Krek (Wife, Mrs Berg M., Pittsburgh, Pennsylvania); Wagonseller (Mother, Edna, Laureldale, Pennsylvania); Rankin (Father, Frank, Lewistown, Pennsylvania); Davis (Wife, Ruth, La Follette, Tennessee); Doub (Father, Harry G., Hagerstown, Maryland); and Gyure (Brother, Albert, Chicago, Illinois).",
    "acmAircraftPosition": "High Element Right Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "41-28651",
    "misMissionNo": 53,
    "acmPlaneRemarks": "This plane and aircrew turned out to be that involved in the mid-air collision with the Dalton ship as the Group formation was enroute to target over France. (The account, and the fate of this plane is related in the Dalton summary above, MACR #3320. There were no crewmember survivors of this flight crew as a result of this mishap). German Report #KUI236, 21 March 1944, at 2315 hours and sent to the (Luftwaffe) Evaluation Center - West Oberursel stated that this Liberator crashed at 1232 hours, 18 March, (1) kilometer south of the village of Doufront, (5) kilometers south of Montdidier, France, due to a mid-air collision (with another B-24, tail number 129174, which was the Dalton ship). All crewmen were found dead in this crashed aircraft. German Report #KU1237 noted that this plane also was probably carrying incendiary bombs containing liquid fuel which completely destroyed the aircraft by fire after the crash. The plane was identified with a blue \"D\" in a white circle and a tail number as '128651'. (Note: Montdidier is about (35) kilometers southeast of AMIENS, France).\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: There were no survivors on this aircrew from the mid-air collison.\r\n\r\nBURIAL RECORDS: The German Report #KU1234, as for the Dalton deceased crewmen, reflected the initial burial of all of these crewmembers in a common grave in the Cemetery Le Pleyren, France, located at the eastern outskirts of this village. One unknown' member, noted as being identifiable by the Germans at the time, was Sgt. Democh. A search of U.S. National overseas Cemetery records lists the following burial information: Feran in the EPINAL, France, location (Grave B-40-22); and also the following crewmen there: Hayes (Grave B-27-22); Gallagher (Grave B20-22); Wheeler (Grave B-30-22) and Boord (Grave A-11). The following medal awards to these men were: Feran (Air Medal w/Oak Leaf Cluster); Hayes (Air Medal with Oak Leaf Cluster and the Purple Heart; Gallagher (no other Medal listed but the Purple Heart); Wheeler (Distinguished Flying Cross and Air Medal w/ (3) Oak Leaf Clusters); and Boord (Air Medal w/Oak Leaf Cluster, and the Purple Heart). \r\n\r\nNEXT OF KIN DATA IN WWII: The data is recorded as follows: Feran (Mother, Cleo E., Minneapolis, Minnesota); Hayes (Wife, Harriette F., Chicago, Illinois); Cummings (Mother, Winifred T., North Braddock, Pennsylvania); Greene (Mother, Ethel M., Watertown, New York); Democh (Mother, Alice, Syracuse, New York); Gallagher (Father, Joseph, Buffalo, New York); Wolfer (Wife, Mary, Trenton, New Jersey); Hampton (Father, William R., Parkin, Arkansas); Wheeler (Mother, Lydia Mae, Inglewood, California); and Boord (Mother, Edna, East Rochester, Ohio).",
    "acmAircraftPosition": "Slot Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "14th CW",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 12
  },
  {
    "acAircraftNo": "42-52411",
    "misMissionNo": 53,
    "acmPlaneRemarks": "The returning eye-witness account stated briefly that this aircraft was seen about (15) minutes after target, drifting away to the left from formation and under control; but no parachutes seen. The time given was 1500 hours and weather was clear, 'CAVU'. German reports on the capture and circumstances involved for some of these crewmen were given as follows: Report #KU1249 reported the crash site of the plane as (1 ) kilometer southwest of Kastenholz-County of SchlettistadVAlsace on 18 March (the time of this crash was given as 1445 hours in this account, however, by the crew's log as to when they were shot up and bailed out after target would place the correct time of the plane's crash around 1512-1520 hours). The above German Report was made by the Air Field Headquarters A-1 ONII at Hagenau/Alsace three days later on 21 March. It also noted the capture of Sgt. Losey at Kinsheim County-SchlettstadVAlsace on 18 March at 1615 hours as well as Sgt Bell in the same location at 1620 hours. This Report continued to summarize that the following crewmen were apprehended once but escaped on a transport on 20 March near Dornata and then were recaptured again in Freiberg: Clover; McMillan; Bellerive; Royal and Berger; and that Galler and Ross had been admitted to the Reserve Hospital Colmar/Alsace - Surgical Department both having fractures of the legs with minor wounds (Galler instep fracture and Ross with left ankle broken and \"complete recovery expected for both\"). A supplementary message to the same report stated that Lt. Berger had been captured on 20 March at 1600 hours at Rappoltsweiler/Als. and that he, along with all the other non-injured crewmen were being sent to Dulag Oberursel on 22 March 1944 for further interrogation. All (11) crewmembers were accounted for in this enemy recap report as being taken as Prisoners-of-War. Other injuries of this crew not mentioned in any German reporting was that Lt. Berger had gotten frost bitten in the ground ordeal, and Sgt. Royal had been wounded above the eye.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: There were several crewmembers who made out 'Casualty Questionnaires' after repatriation from POW status to U.S. authorities who gave varying accounts of the crew's emergency situation on this mission. One such was that of the crew primary Navigator, that of (then) Captain William McMillan who summarized the following circumstances: On the route flown he noted that the \"Group Lead overshot turning point and the l.P. causing Group to fall behind (the) Division, and be attacked by (90) fighters, and their crew left the formation between Colmar and Stuttgart west of the Rhine River and the remainder of their block was shot down or left formation\". He continued this account by noting the entire crew began bail out at 1510 hours after being hit by heavy enemy fighter fire; that all crew members got out of the plane around (30) seconds before the aircraft exploded; all parachuted within a five minute period and landed within a (25) mile area and subsequently were captured within two days later. His report continued by stating that all members were accounted for after the war except for Sgt. Ross who had to fall out of a forced march across Germany as a POW due to illness of fever. Regarding the fate of Pilot Clover (which was not known at this time after the war by U.S. authorities presumably), the Navigator further stated that U. Clover had continued interphone conversation all along descabing condition of the plane, the attacking fighter positions, and ending with a warning that the aircraft was about to blow up followed with the \"bail out\" order. The Co-Pilot, U. Berger, in his account stated their ship had not actually left the formation at all (their formation position was that of lead ship' in the 2nd Section, Low and Left of the main lead' formation); that he knew all crewmen got out of the ship safely; and later he did see all crewmembers at Camp Lucky Strike (Le Havre, France area) and at Camp Kilmer, New Jersey. In regards to his query about the Pilot, the latter noted that U. Clover had given the \"bail order\" on interphone followed by ringing the ship's alanm bell; that he last saw Clover at the Dulag-Luft interrogation center; and had obtained heresay evidence that the Pilot had been taken to an Officers' POW Camp at Sagan, Stalag Luft lilt A third crew member also rendered a 'Casualty Questionnaire' account (name of crewman not given) on the individual members sometime after the war. This account noted that he had heard from each and all crew members later (except for Lt. Clover whom he had seen at Camp Lucky Strike after POW release); that he had been in touch with these men from their homes and knew their general \"status\" as related to him concerning their ordeals and wounds. He stated that there were (11) men but the extra crew member's name he did not recall at this writing, however he had heard from this individual who also stated he had been wounded in the hand by flak during their emergency (this 11th individual was the second navigator person, Lt. Ray Mitchell). It was further noted that he learned that one other crew member, Sgt. Losey, Flight Engineer, had had an operation on his neck while in POW camp to remove some scar tissue and dirt thought to have been caused from a wound of flying glass during the crew in-flight emergency. It seemed in conclusion that reporting crewmembers thought that most or all of their aircrew were on their 22nd or 23rd combat mission this day.\r\n\r\nBURIAL RECORDS: Not involved for this aircrew as all crewmembers survived and were taken as POWs.\r\n\r\nNEXT OF KIN DATA IN WWII: Information in this MACR is as follows: Clover (Mother, Louise M., Roseville, Califomia); Berger (Mother, Pearl L., Perry, Oklahoma); McMillian (Wife, Mary L., Shaker Heights, Ohio); McDonald (Wife, Louise S., WinstonSalem, North Carolina); Galler (Mother, Clara, Washington, D.C.); Bell (Mother, Mary W., New Kensington, Pennsylvania); Losey (Mother, Mae Y., Unionville, Missouri); Crawford (Wife, Betty E., Polk, Pennsylvania); Royal (Mother, Dixie W., Talladega, Alabama); Ross (Father-in-Law, William E Bergis, Hinsdale, New Hampshire); and Mitchell (Father, Thomas D., Wilson, Oklahoma).",
    "acmAircraftPosition": "Lead Crew",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-52465",
    "misMissionNo": 53,
    "acmPlaneRemarks": "The returning crews' eye-witness observation was very brief: \"This aircraft was seen to crash; no chutes seen\". A German Report #KU1254 from Air Base Headquarters Echterdingen (outside Stuttgart) stated this aircraft had crashed at 1510 hours, (400) meters west of Mariatell near Schramberg, County of Rottweil, Germany and that (5) men were found dead at the crash and fate of the others was not known. The aircraft tail number was identified correctly but other recognition was not possible due to the bumed condition. Cause of downing was ascribed to be \"fighter\". One deceased crewmember had been recovered in a field near Hardt, Schramberg, while (3) were found inside the plane and the fourth's location (Lt. Hunter) at the crash site wasn't given in this reporting. One of the two surviving crewmembers, Lt. Delmar Johnson, the crew Navigator, gave this report: That he and Sgt. Milliken were the only two crewmen thought to have bailed out of this stricken ship successfully; aircraft's position at the time it left the group formation was at approximately 48-1 ON,08-25E; and all other crewmembers were in their battle positions, either badly injured or dead when the plane seemed to \"pancake\" into a vacant lot on the outskirts of a small village and catch on fire from ruptured wing fuel tanks; that he landed just east of this village near an evergreen forest where there was about one inch of snow covering the ground. He then met Sgt. Milliken, the other survivor, and they were sheltered in the village town hall where a nurse tended to the narrator's fractured left lower leg and injured right knee. He was later admitted to POW Hospital at St. Agnes in Freiberg on 19 March for treatment.\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: Lt. Johnson's account noted further that he and Sgt. Milliken had been picked up in a Wehrmacht army truck and taken to a prison compound at Villingen, Germany. Along the way other downed American flyers had been picked up as well. While there, a Luftwaffe man questioned them about a crew member whose dog tags this individual had, Lt. Hunter, the crew Bombardier. Both denied any knowledge about Hunter, and the subject was not pressed further by the Germans. On other crewmen who apparently went down with the plane, some were known to be mortally injured or dead from the fighter attacks. The crew was reported to be on their 1 7th combat mission.\r\nBURIAL RECORDS: The German report #KUI254 of 21 March 1944 notes that the (5) dead crewmembers found at the crash area were interred in the Cemetery of Mariatell, near Schramberg, County of Rottweil on 21 March 1944. (Note: Just who these men were is not positively known - neither from the German records or the U.S. National Cemetery listings; however, it seems certain that one of these bodies was that of the Bombardier, U. Hunter). U.S. Military overseas Cemetery listings record the following re-interments: Paules at the U.S. National Cemetery of LORRAINE, France (Grave A-22-29); Kimball also in that location (Grave J-14-17) and Nixon as well (Grave J-44-17) including Wohistrom (Grave B-16-26). Stancik is interred in the U.S. Military plot at BRITTANY, France. No other information exists in the records on the other (3) crewmen: Pilot, Lt. Rex Johnson, Lt. Hunter and Sgt. Reynolds. Limited information exists on Medals awarded to some of these crewmembers, as follows: Kimball (Air Medal with Oak Leaf Cluster); Nixon (Air Medal with (3) Oak Leaf Clusters); Stancik (Air Medal with (2) Oak Leaf Clusters, and the Purple Heart); and Wohistrom (Air Medal with Oak Leaf Cluster and a Purple Heart).\r\nNEXT OF KIN DATA IN WWII: Information in this MACR is: Johnson (Rex) (Mother, La Harpe, Kansas); Paules (Mother, Caroline A., Bloomsberg, Pennsylvania); Johnson (Delmar, Wife, Lucille B., Vancouver, Washington); Hunter (Father, John S., Lynwood, California); Wohistrom (Sister, Mrs Esther Larson, Orange, Connecticut); Kimball (Wife, Beatrice M., Portland, Maine); Stancik (Sister, Mrs. Helen Magee, Los Angeles, California); Reynolds (Mother, Mittie, Texarkana, Texas); Milliken (Wife, Virginia M., Denver, Colorado); and Nixon (Brother, Adelbert G., Blanchard, Oklahoma).",
    "acmAircraftPosition": "Low Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "14th CW",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 2
  },
  {
    "acAircraftNo": "42-99945",
    "misMissionNo": 53,
    "acmPlaneRemarks": "There were no eye-witness accounts by returning aircrews about the missing status of this plane and crew. The only report of this aircrew's downing and capture was in a German Report #KU1231, Air Field Headquarters at Freiberg dated 28 March 1944. This reporting noted the crash site of this aircraft by correct tail number at a location of Mushlenbach near Hasslach, (30) kilometers north east of Freiberg/Breiagen at 1500 hours and the ensuing capture of all (10) crew members who had parachuted to safety. Cause of the ship's downing was described as being \"fighter\", as obtained from a statement by local inhabitants.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: No record exists in the MACR. All members were taken as prisoners by the Germans. The time of apprehending was given as 1500 hours for all (10) men. Sooy was captured at Hasslach/Kinzig Valley as were McBrayer, Mardis, Schwark, McArn, Dorgan, Nixon, and Serafine. Jones and Terrell were taken prisoner near Kuehlenbach. This information is all that is available in these records.\r\n\r\nBURIAL RECORDS: None; all men survived this mishap and were taken as POWs.\r\n \r\nNEXT OF KIN DATA IN WWII: The following record is given: Sooy (Aunt, Mrs. A. Wolston, Camden, New Jersey); Jones (Wife, Dixie, Maize, Kansas); Mardis (Mother, Alma K., Cincinnati, Ohio); Terrell (Mother, Helen R., Washington, Indiana); Serafine (Mother, Mrs. Julia Kubisenki, Binghampton, New York); Jones (Father, Simon I., Texarkana, Arkansas); Dorgan (Mother, Susan J., Lone Rock, Wisconsin); Schwark (Wife, Gloria, New York, New York); McBrayer (Mother, Ola W., Atlanta, Georgia); McArn (Mother, Bessie W., Rowland, North Carolina).",
    "acmAircraftPosition": "Low Element Diamond",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "14th CW",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 2
  },
  {
    "acAircraftNo": "42-99981",
    "misMissionNo": 53,
    "acmPlaneRemarks": "The only eye-witness accounts were brief from returning crews: \"Aircraft last seen in a power dive about 2,000 feet; one chute seen\". Pilot Peterson's later account after repatriation from POW status noted that their aircraft came under heavy fighter attacks after departing the target area, and he estimated they left the Group formation about (30) kilometers east of Strasburg, France where those crewmen who did survive managed to bail out of their gravely damaged plane. German Report #KU1243 from Air Field Command Freiburg to Dulag-Luft Oberursel/Frankfurt, dated 21 March 1944 at 1850 hours reported the crash location of the Peterson aircraft as in the Territory of Ettenheimmuenster, (30) kilometers north of Freiberg, Germany. \r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: Lt. Peterson's later report summarized the information as follows: That he and (4) other members did finally manage to bail out of this aircraft which was totally uncontrollable; all landed within a one mile radius of each other, and he about (300) feet from where their plane had crashed; that to the best of his knowledge the Tail Gunner, two Waist Gunners, Ball Turret Gunner and Bombardier were all either mortally injured or dead at their positions while in the air, and crashed with the ship. He noted that the Tail Gunner was repofting enemy fighter attacks, then suddenly ceased. Another crew member's account in completing an \"Individual Casualty Questionnaire\" on the Tail Gunner's fate and the other Gunners in the waist section to U.S. authorities later stated that he believed their plane was struck by a Gemman fighter just in front of the tail section causing the ship to go into a spin immediately which most likely prevented any member in the rear from bailing out. This report continued on the Bombardier's plight which stated that a German captor related to the Radio Operator subsequently that Lt. Brown's body was found in the nose turret at the crash site. The Bombardier had been calling out previous f\u0001ghter passes, but it was noted that he did not fire his guns on the final attack indicating he may have been killed at that time. (Note: It is surmised that this final head-on enemy attack resulted in this fighter striking the plane's aft fuselage section). The German Report cited above included attachments which also summarized the crew members ultimate situations and fates on the ground later: it noted the capture of (4) crewmen as Peterson, Hinshaw, and Moorehead at the village of Ettenheimmuenster at 1600 hours the same day; the hospitalization of a wounded member, Co-Pilot Vrieling, who was taken to the PW Hospital in Strasburg/Alsace and admitted the next day, 19 March; and the recovery of (4) other dead crewmen, Harrell, Hancock and Byrd with Hunter in the crashed plane. The ship was fully identified by correct tail number, 578th Squadron, 392nd Group, and Base of Wendling. There was also an erroneous conclusion in this enemy report on the crew's target this day as 'Target: Air Base Freiberg'. This German reporting also picked up data on the 5th member captured, that of Sgt. Rosko who was admitted to the PW Hospital in Strasburg, France also. The identification tags of all (10) crewmen were also recorded in this enemy report which also gave full information on each member's next-of-kin names and home addresses. This enemy reporting covered a number of updates under the same report number to German higher echelons of air command. The last and concluding account dealt with the finding of the 5th deceased crew member's final whereabouts, Sgt. Masters, over four months later on 31 July 1944 when local berry-pickers found his remains and ID tags. Crew missions flown including this one were given as (16) to (19) combat missions for various individual members from the survivor accounts.\r\n\r\nBURIAL RECORDS: German accounts on initial burial were contained in the above report attachments, as follows: The (4) members found together at the crash site were interred in the town Cemetery of Ettenheimmuenster in a common grave on 21 March. Sgt. Masters was reported later as being buried in the same communal cemetery, Special Grave #2, on 31 July 1944 the day his remains were recovered. There is no record in the U.S. National overseas Cemetery listings regarding the reinterrment of any of the (5) deceased crewmen from their initial German burial site and no indication as to whether recovery and reburial in the States was eventually accomplished at request of families.\r\n\r\nNEXT OF KIN DATA IN WWII: Information given in this MACR is: Peterson (Wife, Leah L. Peterson, Anoka, Minnesota); Vrieling (Father, John, Holland, Michigan); Moorehead (Mother, Nell A., Portsmouth, Virginia); Brown (Wife, Frances A., Hollywood, California); Rosko (Mother, Eva L., Brooklyn, New York); Masters (Mother, Mullin, Texas); Hinshaw (Brother-Family, Mrs Virginia Lee Anderson, Chicago, Illinois); Hancock (Wife, Jean 0., Seattle, Washington); Harrell (Wife, Betty, Hammond, Indiana); and Byrd (Mother, Ora L., Amarillo, Texas).",
    "acmAircraftPosition": "High Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-100117",
    "misMissionNo": 53,
    "acmPlaneRemarks": "The MACR cites very briefly the eye-witness account on the missing status of this aircrew. This observation noted the time and position where the plane was last seen: At 1505 hours and 48-12N, 08-12E, under enemy fighter attack. German Report #KU1245, Air Field Command A-2NII, Freiberg, dated 22 March 1944, cites this aircraft's crash location as being near the village of Ettenheimmuenster, (30) kilometers north of Freiberg and (500) meters north east of this smaller town. A supplementary page to this same report (teletype message format sent by the same headquarters to the interrogation center at Dulag Lutt-Oberursel/Frankfurt) of 21 March at 1925 hours stated the finding of (6) dead crewmen at the burned plane's crash site, and identification of the ship's tail number though this aircraft was reported as being 100% damaged. The Sharpe crew's plane and that of the Peterson (C.L) crew crashed almost in the same proximity and the German repofting reflected an intermingled listing of members from both aircrews of capture, and recovery of the perished crewmen, from both crash areas on the same report. Local inhabitants of the village area reported the Sharpe aircraft being shot down by a fighter according to this enemy report\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: From the limited MACR record on the Sharpe crewmembers, the one \"CASUALTY QUESTIONNAIRE\" completed by Sgt. Anderson after repatriation and given to U.S. authorities does give these particulars about this combat tragedy: that after the target bomb drop, all members at that time were at their crew stations, unharmed (ostensibly learned from a crew 'interphone check' immediately after the bomb run); that shortly thereafter an enemy fighter attack resulted in the Pilot and Co-Pilot being wounded such that each immediately discussed over intercomm which one would (could?) fly the aircraft; (Pilot was reportedly wounded in the right arm while the Co-Pilot had been struck in the left leg)) and this attack resulted in an aircraft fire with the plane going into a spin. His account reported that one Gunner, Sgt. Cugini, bailed out when the ship caught fire, and he followed. This report speculated further that it was felt that Pilot Sharpe, Co-Pilot Bandura, and Tail Gunner Maylander all went down in the plane. As a concluding comment about the Pilot's injury, it was also noted that Lt. Sharpe had requested that the Radio Operator render first-aid to him. A final statement on this crewmember's reporting gave the plane's crash location as being (20) miles southwest of the town of Freiberg, however the later German Report on-scene pinpointed the final position as north of Freiberg. (Note: One seemingly unresolved circumstance on the actual fate at the time of downing of each man of the Sharpe crew seems apparent: the German Report #KU1245 attachments (found in the Peterson's crew MACR #3328 due to the 'mixing of the crewmen listings and accounts' described earlier), states that (6) Sharpe crewmembers were found dead at the crash site of their plane, identified by the correct tail number. This same report also notes the taking of (4) prisoners at the same location. Inasmuch as seven (7) members of this aircrew are recorded in the MACR as having perished during the war, the additional man who perished appears to have been one who was taken prisoner in the crash area initially, and later due to unknown, unstated causes subsequently died while in POW status. While being supposition, though all related reports in these two MACRs have been sifted through very carefully, a conclusion seems to point that this additional member of the Sharpe crew was the Radio Operator, Sgt. Wallace, who was initially taken prisoner, and, but wounded, and later died while in, or as a result of, captivity. This conclusion stems from the fact that one of the German Report attachments found in the Sharpe crew MACR (part of #KU1245) reflects Sgt. Wallace along with Sgt. Coveney as wounded, and having been admitted to the PW Hospital 5C in Strasburg, Alsace, France on 19 March 1944. Inasmuch as the Bombardier Richardson and Gunner Maylander were buried in the communal cemetery at Ettenheimmuenster on 21 March along with some members of the Peterson crew; and there are known U.S. Military overseas Cemetery grave locations for Lt. McGuire and Sgt. Huffman adding to the (3) members who were known to have survived and resumed to the States from POW status as being Anderson, Cugini, and Coveney - a total of p) crewmen is thus accounted for. Accordingly, this accounting would leave both pilots and Sgt. Wallace remaining to conclude about their individual fates. Since Wallace was reported as being captured at the same time but wounded, as given in the German report, though his full name was listed correctly but the senal number for him was incorrect, the premise that the \"7th\" casualty on this aircrew was Wallace seems most likely the circumstance. Al1 of the Peterson crewmen who were found perished in the same general area were positively accounted for which tends to re-enforce the above conclusion in spite of the mixed crew listings' rendered at the time by the Germans).\r\n\r\nBURIAL RECORDS: MACR records searched on both the Sharpe and Peterson aircrews reflect the following from German Report #KUI245 found in the Peterson crew file, MACR #3328: Lt. Richardson, Bombardier and Sgt. Maylander, Tail Gunner of the Sharpe crew were buried in the communal Cemetery at Ettenheimmuenster on 21 March 1944. This same report number (by an attached message form of 22 March also stated the burial of (2) other dead members of the Sharpe plane crash whose names and serial numbers were (quote) \"unknown and not ascertainable\" (end quote). No further information can be reconstructed regarding names from a search of these MACR records. Examination of U.S. National overseas Military Cemetery records reflect the later recovery and re-interments of these Sharpe aircrew members: Lt. McGuire was reburied in the National cemetery of LORRAINE (St. Avold, France) in Grave # A-23-40; Sgt. Huffman in the same location, Grave # D-3721 and Lt. Richardson also in Grave # E-16-19. No further information is available on the recovery and re-burials of the remaining crewmen known to have perished, or about the casualty situation concerning Sgt. Wallace. The National Cemetery record reflects the following Medals earned by the listed men interred there: McGuire (Air Medal with oak Leaf Cluster; Huffman (Air Medal with (2) Oak Leaf Clusters) and Richardson (Air Medal with Oak Leaf Cluster). All three members have \"/\" following their Medal award listings record; but only Huffman's has a continuation symbol to reflect that at least one of his awards was the Purple Heart. From survivor crew member statements, it appears this crew had a total of (15) combat missions flown prior to this bombing raid for most all, if not all, members assigned. (Note: Sgt. Huffman may have flown some additional missions from the Air Medal awards given him. Also, the final whereabouts concerning the recovery of both pilots, Lt. Sharpe and Lt. Bandura, remain uncertain and unknown from available research records at hand).\r\n\r\nNEXT OF KIN DATA IN WWII: Information given in the MACR reflects the following: Sharpe (Mother, Freda, Carmel, California); Bandura (Mother, Mary J., Santa Monica, California); McGuire (Wife, Muriel P., Brooklyn, New York); Richardson (Sister, Alice M., Harve, Montana); Wallace (Father, John M., Spokane, Washington); Huffman (Mother, Frances G., Atchison, Kansas); Anderson (Mother, Alma M., Perry, lowa); Cugini (Wife, Arlene P., Buffalo, New York); Coveney (Wife, Gertrude V., Woodside, New York); and Maylander (relationship not given, Mr. Albert Maylander, Brooklyn, New York).",
    "acmAircraftPosition": "Slot Element Left Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-109824",
    "misMissionNo": 53,
    "acmPlaneRemarks": "Contrary to what eye-witness accounts from returning crews reported as occurring enroute over France where the aircraft of Lt. Dalton (MACR #3320) had experienced a mid-air collison with another 392nd plane, the latter ship was not that of Lt. Anderson, but rather the aircraft of U. Feran (MACR #3324). U. Anderson and his crew proceeded to the target, and after bombing, was attacked and downed by enemy fighter attacks. His account as Pilot is listed in summary: that their plane was attacked about (30) minutes after target at which point they left the bomber formation; that he and two others that he knew of did bailout successfully (Sgts. Ferren and Masteka) through the bomb bay doors and some of the other crewmen were either dead or injured so as to be incapacitated at this time in order to abandon the ship, however (4) parachutes were seen to bum on opening and the Tail Gunner was believed to be one of these. He stated further that the CoPilot, Lt. Maben, did exit the plane through the top hatch in the radio compartment, but was believed to have struck the top turret or tail assembly in bailing out. Another comment noted that Germans reported later that this crewmember was found on the ground with parachute unopened. The Flight Engineer's later report stated that when the fighter attacks occurred, the plane's flight controls were knocked out', and the Pilot, Radio Operator, and he went out the bomb bay in that order after the Pilot had opened the doors. He knew the Co-Pilot was having to put his parachute on at the same time, but did not know why he did not get out successfully, unless he was suddenly injured. It was also stated that a German Officer later said that the men in the plane's nose section were found dead in the crashed ship. German Report #KU1255, Air Headquarters District in Boeblingen (Stuttgart area southwest suburb), dated 23 March, stated the crash location of the Anderson aircraft as occurring at 1500 hours, (2) kilometers southwest of Stettin, County of Rottweil, and about (6) kilometers west of Rottweil. Attachments to this same German report recorded the recovery of (7) dead crewmen at the crash site; (2) of whom \"may be identified after recovery of (this) plane\". The crew members positively identified at that time were: Lts. Maben, Cashen, Linzey, Sgt. Hardic, and Sgt. Cagle. Sgts. Koch and Bixby were subsequently identified by initial burial time of all deceased crewmen. Other attachments of this same report cited the capture of the (3) survivors, Anderson, Farren, and Masteka and related the findings from the aircraft's wreckage that the plane was assigned to the 392nd at Wendling Base and the 577th Squadron. The latter also mentioned the plane's target (erroneously) as \"Echterdingen\" (which was an airfield just on the southem outskirts of Stuttgart).\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: These were summarized above as given by Pilot Anderson and Flight Engineer Farren after their repatriation from POW status in their 'Casualty Questionnaire' statements.\r\n\r\nBURIAL RECORDS: The MACR record contained in the German Report #KUI255 stated that all (7) casualties of this aircrew were buried on 22 March 1944 in the village cemetery at Stette, near Rottweil. A search of U.S. National overseas Military Cemetery listings finds the following: Maben buned in the LORRAINE location (Grave #K-32-32) as well as Hardic (Grave #K-33-39) and in the ARDENNES Cemetery, Hardic is interred (Grave #C-25-20). Medal citations also notes that all three members were awarded the Air Medal and Purple Heart. From the survivor reports, it is indicated that this mission was probably the crew's 6th combat sortie.\r\n\r\nNEXT OF KIN DATA IN WWII: The information contained in this MACR is of very poor quality for interpreting correctly. However, the following data can be made out in general terms on certain individuals of these crew members: Bixby (Mother, Mary, Dundee, New York); Koch (Mother, Pearl K., Louisville, Kentucky); Cagle (Father, Charles V., Greensboro, North Carolina); Farren (Father, Elmer F., Yorkville, llinois); Hardic (Mother, Mary, Carlisle, Pennsylvania); Masteka (Mother, Edna, New Rochelle, New Yoric); Linzey (Wife, Mildred, Flint, Michigan); Maben (Mother, Los Angeles, California); Anderson (illegible data, Ohio?).",
    "acmAircraftPosition": "Low Element Left Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-109826",
    "misMissionNo": 53,
    "acmPlaneRemarks": "Eye-witness accounts of returning aircrews had no observations to report concerning the loss of this aircrew and plane. Later facts revealed that this aircraft had come under fighter attacks on the route outbound after target: the Pilot, Flight Engineer, both Waist Gunners and the Tail Gunner bailed out over Germany near Rottweil and were taken prisoner except for one Waist Gunner, Sgt. Wagner, who was killed when his parachute did not open; and the CoPilot stayed with the ship and diverted it to Switzerland, crash landing the plane safely at Dubendorf Field (near Zurich) where he, the Navigator, Bombardier, Radio Operator and Ball Turret Gunner were intemed. Their aircraft crash landed at Dubendorf at 1545 hours of the mission day.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: Pilot Haffermehl's \"Casualty Questionnaire\" given after repatriation later to U.S. authorities was very brief on events that took place and had no precise knowledge to record except that he had seen Sgt. Landry and Sgt. Hardwick in good health the next day after they all were captured in Germany. In another report conceming his deceased Gunner, Sgt. Wagner, the Pilot stated \"five of us, including S/Sgt. Wagner, bailed out when the plane was hit. I didn't see him (Wagner), but the tail gunner said that his parachute didn't open and that he saw S/Sgt. Wagner's body on the ground and positively identified it. Later unidentified Germans told me that he was dead\". Another crewmember's account (name not given) on possible casualties of others on this crew stated that the Bombardier, Lt. Poppel, was last heard of giving out reports in the air on attacking enemy fighters and still later this crewmember had received a letter in POW Camp, Stalag Luft #4, from Poppel who was writing from internment in Switzerland. This account noted also that Lt. Poppel had been wounded by 20MM cannon fire at his crew station, but had recovered successfully. Still another crewmember account given later (name not given) stated that the Bombardier was injured in the air, did not bail out, was last seen on the flight deck, and that the CoPilot had refused to bail out, electing to fly the ship towards Switzerland where it was crash landed safely. A German Report, Air Headquarters in Freiberg, #KU873A reported the captured of the (4) men taken prisoner as follows: Haffermehl at 1700 hours near Neierlingen,Waldshut County; Harwick and Landry at 1530 hours at Beren, Waldshut County, all on 18 March. This report also reported the recovery of the dead crewmember, Sgt. Wagner. One last crewmember account given on the fate of Sgt. Wagner stated that another crewman in captivity with him later had actually seen the body of this Gunner Iying on the ground, and Sgt. Wagner's parachute was Iying about him but had not opened. The man had suffered mortal wounds in his stomach area and undemeath the chin. It was mentioned further that Sgt. Wagner had gotten out of the plane safely, but perhaps was too low or waited too long to pull the rip cord on his chute. Regarding the capture of the fourth crew member, Sgt. Parker, the German report noted his being taken prisoner near the the town of Rottweil at 1600 hours, 18 March. Survivor accounts also stated the crew's total combat mission count as (20) sorties.\r\n\r\nBURIAL RECORDS: The German records reflect that Sgt. Wagner was buried initially in the town cemetery at Boren, Waldshut County on 22 March. U.S. National overseas Military Cemetery listings show that Sgt. Wagner's remains were recovered from Germany and reinterred in the LORRAINE Cemetery (Grave # E-22-42). Records reflect that he was awarded a Distinguished Flying Cross and the Air Medal with (3) Oak Leaf Clusters. There is no indication of any posthumous awards.\r\n\r\nNEXT OF KIN DATA IN WWII: Information is as follows: Haffermehl (Wife, Beverly, Boston, Massachusetts); Poppel (Mother, Dora O., Lowell, Massachusetts); MacMullen (Mother, Gertrude F., Pottstown, Pennsylvania); Parks (Wife, Regina M., Chicago, Illinois); Beausoleil (Father, Wilford, Alhambra, Califomia); Parker (Mother, Ida M. Newburgh, Indiana); Harwick (Mother, Evelyn M., Leechburg, Pennsylvania); Wagner (Sister, Madline S. Wagner, Glendale, Queens, New York); Mitchell (Mother, Dellie M., Sulphur Springs, Texas); Landry (Mother, Laura, Lowell, Massachusetts).",
    "acmAircraftPosition": "High Element Right Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "14th CW",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "41-29127",
    "misMissionNo": 53,
    "acmPlaneRemarks": "Returning crew member eye-witness accounts stated \"it is believed that this aircraft was straggling off to the left of the formation for (20) minutes before target. Salvoed bombs and went to the right and under the formation toward Switzerland\". The after mission facts confirmed this aircraft and crew had landed at Dubendorf Field (near Zurich) in Switzerland at 1442 hours. The aircrew Bombardier later gave this account after the war from his Stateside address: \"Our crippled ship landed at a field at Dubendorf, Switzerland on 18 March 1944. Our number one engine had gone out because of mechanical failure and (15) minutes short of the l.P., the number two engine ran away up to 3500 RPMs. We were interned upon reaching Swiss territory and myself and S/Sgt. Haaland, a gunner, were treated for frozen toes. When I left, all the crew were interned in Switzerland and were well with the exception of Sgt. Haaland who had T.B. (tuberculosis) and was in the hospital. I saw Lt. Kale in London (later); he had left Switzerland a week before I did\". This crew member report had been made on 9 October 1944 from his Lawrenceburg, Tennessee address. No other amplifying details were contained in this MACR record.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The Bombardier's account given after his return from internment, as noted above, is the sole record on this aircrew.\r\n\r\nBURIAL RECORDS: None. All crew members were intemed and survived this ordeal.\r\n\r\nNEXT OF KIN IN WWII: No information is available in this MACR except the Stateside home town of Lt. White as given above.",
    "acmAircraftPosition": "High Element Diamond",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 9
  },
  {
    "acAircraftNo": "42-100100",
    "misMissionNo": 53,
    "acmPlaneRemarks": "This aircraft resumed safely to Wendling after the Fredrichshafen mission but suffered major battle damage enroute home over France. The Navigator, Lt. Walsh, and Bombardier, Lt. Savage, were casualties on this retum and were lost over France after parachuting from the plane. On 18 April 1944, the Pilot, Lt. Muldoon, gave this account of these events: \"This aircraft, B-24J #42-100100, with the rest of the formation was under attack by enemy aircraft on route home from target (Fredrichshafen, Germany), and as the aircraft crossed into France (48-20N, 07-35E) the plane was hit by a 20MM shell and caught fire. Apparently the fire set off the bail-out bell signal (short circuit probable) since the pilot did not order the crew to abandon ship. These men (Lt Walsh and Lt. Savage referenced) bailed out at approximately 1505 hours at 17,000 feet. No one reported sighting the parachutes opening or the men landing. Both were equipped with parachutes\". This report was the extent of the record contained in this MACR.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The Pilot's statement above is the only report found.\r\n\r\nBURIAL RECORDS: There were no records regarding recovery, or the burial of these two crewmembers by any German accounts or other sources. Neither man is listed on any U.S. National overseas Military Cemetery records.\r\n\r\nNEXT OF KIN IN DATA WWII: No records are included in this MACR account.",
    "acmAircraftPosition": "Low Element Right Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Lead Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 8
  },
  {
    "acAircraftNo": "41-29192",
    "misMissionNo": 41,
    "acmPlaneRemarks": "MISSION LOSS CIRCUMSTANCES: The entire Group, and Second Air Division bomber stream, underwent fierce and aggressive enemy fighter attacks enroute to and over the target and briefly outbound after the highly successful bombing attack against the German Messerschmidt aircraft plant at Gotha. As the 392nd was the leading Group from the Initial Point (IP) onto the bomb run of all the Division's B-24 Groups, after having identified correctly this proper turn-in point in the face of a navigation error made by preceding Liberator units leading the bomber stream which were then steering off-course, the 392nd up front was taking the full brunt of these fighter attacks. Shortly after the bomb run, the White aircraft, as an element leader in the High Block, was heavily damaged and set afffie necessitating this aircrew to abandon this severely crippled ship. The time by eye witness accounts was 1338 hours, (17) minutes after 'bombs away' on target. This plane's position then was noted to be at 50-37N, 09-40E. One aircrew reported seeing (3) parachutes from the White ship, however, ten crew members did bail out successfully from this aircraft as later verified, all but one of whom were taken as POWs.\r\n                                                                                                                           INDIVIDUAL ACCOUNTS OF CREWMEN FATES:  The Radio Operator, Sgt. Wenslaff, was the only member who perished in this crew emergency. Later accounts by the Co-Pilot on release from POW status, stated that Sgt. Wenslaff was last seen under the main flight deck trying to operate the bomb bay manual hydraulic release handle. He was reported to have his clothing on fire but was alive at this time. It was further noted in this account that the Radio Operator had given a hand salute, but could then not be reached due to the severe fire raging below the flight deck. Later, this same report by the Co-Pilot stated that through a German report while he was prisoner in Stalag Luft 1 it was reamed that the deceased crewmember had been buried near a small village near Gotha. Other observations made in this same account also covered the fact that the Co-Pilot had gone down onto the bomb bay catwalk in an attempt to figm the flames, but had to retum to advise the Pilot that such was impossible, following which the bailout order was given. The Co-Pilot was wounded and suffered from temporary blindness from the fire effects following his bail out though he did observe (9) parachutes still in the air as the ship crashed into the small town of Westersheofen. This account by the Co-Pilot's in having seen the Radio Operator during the crew emergency was later acknowledged to be the only one from any crewmember who remembered seeing this crew man during and after the event. (Author's note: The correct spelling of this German village where the aircraft crashed is not clearly discernible in the Co-Pilot's account. Also, the crew member who perished in this emergency must have somehow managed a bail out of the stricken ship since the above report appears to account for a total of (10) parachutes being in the air at the time of the plane's crash (including the Co-Pilot's?). The German reports attached with the MACR, #KU974, dated 24 February 1944, accounts for the (9) men taken POW, and also the name of the tenth man, Sgt. Wenzlaff, who was probably found dead in his parachute).\r\n\r\nBURIAL RECORDS: There are no German, or later, any record on any U.S. National Cemetery burial or missing listing on Sgt. Wenzlaff in this MACR. The Co-Pilot's account, however, mentions that this crewmember reportedly was buried in a small village cemetery near Gotha. That is all that is known from official records. This mission was the crew's tenth.\r\n\r\nNEXT OF KIN DATA IN WWII:   Information available is as follows: White (Father, James M., Midland, Texas); Cheairs (Father, William, Sr., Memphis, Tennessee); Bennett (Wife, Agnes, Indianapolis, Indiana); Fross (Wife, Ona H., Sommerville, Missouri); Wenzlaff (Mother, Minnie, Appleton, Wisconsin); Jackson (Mother, Mrs. Willie S., Commares, Georgia); Martin (Mother, Betty of Chattanooga, Tennessee); Kost (Sister, Marie Erickson, Belleview, Pennsylvania); Baldwin (Wife, Rosemary C., Hamilton, Ohio); and Burns (Mother, Mrs Lora Burns, Carton, North Carolina).\r\n\r\nPRIMARY SOURCE RESEARCH NOTE: In 1993, a German researcher in Hamburg, Germany by the name of Christian Loop, address Waldorferstrasse 47, W-2000 Hamburg 70, wrote in a letter of 3 March 1993 to Clifford Peterson, 392nd Bomb Group, that he was compiling a documentary conceming the series of American and British air raids on Germany which had taken place during the large scale, massive attacks of \"BIG WEEK\", the Eighth AF's concerted air offensive against Third Reich aircraft and armaments industries. He was interested particularly in two specific attacks by the 392nd which had taken place on the 20th and 24th February 1944 against the targets of Halberstedt and Gotha, respectively. This researcher went on to note further that a \"little city of Helmstedt was attacked by mistake\" instead of Halberstadt, and an enclosed German account of that event in a newspaper article, also forwarded, described the devastation of this town in the five minute bombing which took place from 1:27-1 :32PM resulting in (129) deaths and 500-600 buildings destroyed or damaged. On the Gotha attack coming four days later on 24 February, Herr Loop also gave information by 392nd crashed aircraft tail number as to the crash sites of the (7) ships that went down on this latter raid. The plane of Lt. White and crew was found at the village of Woltershauseun near Alfeld. It was noted further that he was able to find some eye-witnesses of these events still living in the area then nearly forty nine years later around 1993.",
    "acmAircraftPosition": "Low Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "High Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-7496",
    "misMissionNo": 41,
    "acmPlaneRemarks": "As in the case of Lt. White's aircraft of the same flight element, this plane and aircrew came under identical and massive enemy fighter attacks immediately after the bombing run on the Gotha target. However, there were no returning aircrew eye-witness accounts specifically dealing with the downing of this aircrew. What is known is that (7) of the ten crewmembers were taken as Prisoners, and (3) perished in this emergency. A local German report, #KU 992 describing the taking of the seven men as POWs was dated the same day, 24 February. This report also cites the recovery of the (3) dead crewmen, two of which were positively identified by their tags, Lt. Doyle and Sgt. Payton - and the third body listed as \"unknown\" at the time, which later proved to be that of Lt. Bamett. The bodies were found near the town of Oberurthausen-Hunberg, District of Hersfeld. The deceased crewmembers were found the day after, 25 February 1944. On the situation about the crew's emergency which was filed later after the war by one of the repatriated crewmembers, name unknown in the MACR records, it was stated that the plane was on fire under the flight deck and part of one of the rudders had been shot off which caused the ship to be somewhat out of control when he bailed out.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The one crewmember report, origin unknown from the MACR record and summarized above, is the only account of this emergency. This latter report mentioned that the author had received information that the bodies of (Sgt.) Josephine B. Payton and (Lt.) Charles C. Doyle were found in a German Cemetery at Seisdorf, but the Aunt of (Pilot) Joseph Barnett had reported the latter's body had not been found as yet. (Author's note: The date of this crew member's report taken after his repatriation from POW status is not known).\r\n\r\nBURIAL RECORDS: The German Report, #KU992's continuation, stated that the bodies of Lt. Doyle and Sgt. Payton were buried on 28th February 1944 at the Communal Cemetery in Seisdorf in a common grave. The body of the third airman was recorded to be charred beyond recognition and no identification tag could be found. This body was also interred in the Seisdorf cemetery plot. In the U.S. National Cemetery records of overseas locations, the following information in this MACR is found: Lt. Barnett was interred in the U.S. Netherlands (MARGRATEN) Cemetery, Grave M-21-15. Sgt. Payton is buried in MARGRATEN also, Grave E-17-5. Both men are noted to have received the Air Medal, and the Purple Heart. On Lt. Doyle, there is no U.S. National Cemetery overseas burial record in any cemetery listed. The latter may have been recovered from the initial interment at Seisdorf, Germany and brought home to the States at request of family, however the MACR does not contain such information.\r\n\r\nNEXT OF KIN IN WWII: There is no existing information in this crew's MACR regarding such data. The U.S. National Cemetery records do reflect that Lt. Barnett's home-of-record was Oklahoma; and Sgt. Payton's as Kentucky.\r\n\r\n(PRIMARY SOURCE RESEARCH NOTE: See White Crew footnote above. The site of the Barnett aircraft, identified by serial number, was found near the town of Oberurfhausen-Hunberg).",
    "acmAircraftPosition": "Low Element Right Wing",
    "acmSquadron": null,
    "acmSquadronPos": "H Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-7511",
    "misMissionNo": 41,
    "acmPlaneRemarks": "The eye-witness account from returning aircrews stated seeing at least four 392nd ships in distress due to continuing fighter attacks - going into the target, in the target area, and during withdrawal from the Gotha raid. The one ship which undoubtedly was the Johns aircrew was last seen in the target area with #2 and #3 engines on fire, the plane losing altitude and out of control, and three (3) parachutes being seen. A German report, #KU631A of 24 February notes that (8) men of this crew were taken as Prisoners soon after they reached the ground: Johns, Silvasy, Sanchez, Przeniczny, Sriver, Gressler, Kenyon, and Henderson.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: It was reliably reported by Lt. Henderson after his release from POW status that it was known, positively, that all (10) crewmembers had successfully bailed out of their stricken ship. His report noted that they were shot up near the target by fighters with #3 engine on fire as well as the fuel tanks. He bailed out through the rear camera hatch in the waist, and there was no other crew person in the ship at this time except the Pilot. He further stated that heresay information came to him by the Pilot later which noted that no members were found in their ship when it crashed. It was also stated that to the knowledge of Lt. Henderson, the Co-Pilot, no crew member was injured at time of their bail out. Another revealing sidelight concerning the fate of one of the two crewmen was a German report #47/89 out of an Air Ministry in Munster and dated 8 August 1944 which reflected the death and burial of one of the Waist Gunners, Sgt. Zerangue. This report listed the date of this crewmember's death as, 30/31 March 1944, over (30) days after the crew was shot down. No other facts were stated in this German Report. Based on this information, it can be concluded that this man had successfully evaded capture until the above date, however, his exact cause of death is not known. The German report merely states cause of death as: \"shot down, type of aircraft not established\". It continued to say that he was found at a location named Wahrda, County of Hersfeld. \r\n\r\nBURIAL RECORDS: The above German report on Sgt. Zerangue stated his burial site as the Community cemetery at Wahrda, County of Hersfeld in a marked mass grave on 3 April 1944. The U.S. National overseas Cemetery listings has Sgt. Zerangue interred at the LORRAINE Cemetery, St. Avold, France in Grave K-32-20. He was awarded the Air Medal with (3) Oak Leaf Clusters. No other notations are stated. On the other deceased crewmember, Sgt. Indahl, no record exists in this MACR concerning an initial German burial or a later U.S. Cemetery interment.\r\n\r\nNEXT OF KIN DATA IN WWII: Information available is as follows: Johns (Aunt, Mrs Bettie I. Perkins, Schoolfield, Virginia); Henderson (Mother, Hattie I., Eshalem, Oregon); Silvasy (Sister, Mrs Arthur F. Taylor, Andover, Ohio); Sriver (Sister, Mrs John J. Morrith, Chicago, Illinois); Indahl (% Mrs Josephine Larson Indahl, Spokane, Washington); Gressler (Wife, Irene N., Grand Rapids, Michigan); Kenyon (Father, Clarence L., Kendall, Wisconsin); Przeniczny (Mother, Mrs Nellie P. Ralgalzy, Trenton, New Jersey); Sanchez (Father, Dennis W., Tularosa, New Mexico); and Zerangue (Wife, Ruth W., New Orleans, Louisiana). Records indicate this crew had flown (10) combat missions.\r\n\r\n(PRIMARY SOURCE RESEARCH NOTE: In reference to the German researcher's letter above on the White crew, it was noted that the Johns aircraft, and listing the correct tail number, had crashed at Raum Herafeld Ultergraben).",
    "acmAircraftPosition": "Slot Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "High Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-7527",
    "misMissionNo": 41,
    "acmPlaneRemarks": "The scanty report regarding the fate of this aircrew and plane was made later after the war by the Pilot, Lt. Patterson. He noted very briefly that their plane had left the formation shortly after the Initial Point (IP), starting the bomb run. There were no eye-witness accounts by returning crews to give any further information about this missing crew's plight. It is surmised that this plane had also undergone fierce enemy fighter attacks leading up to the bomb run.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The after-liberation report given by the Pilot was general in nature and did not cover the knowledge of loss on any crewmembers in his completing a Casualty Questionnaire for higher authorities. He noted that he knew (4) members had bailed out without problems, but that he had received this information later after his liberation. He further stated that his aircraft crashed about (25) miles west of Gotha. (Note: The bomb run was begun from an IP slightly southwest of the Gotha target). There were no German ground reports about this aircrew or any individual members in this MACR.\r\n\r\nBURIAL RECORDS: None are given in this MACR - either German or from U.S. National overseas Cemetery listings.\r\n\r\nNEXT OF KIN DATA IN WWII: MACR records indicate the following: Patterson (Friend, Miss Dorothy J. Robbins, Price, Idaho); Shelton (Wife, Martha F., St. Louis, Missouri); Henderson (Mother, Norma O. Harley, Kansas City, Missouri); Feldman (Mother, Mrs Lillian, Philadelphia, Pennsylvania); Peterson (Uncle, Emil Anderson, Boquian, Washington); Connelly (Brother, Patrick F., New York, New York); Jackson (Father, James A., Roper, North Carolina); Luciano (Father, Thomas, Bridgeport, Connecticut); Nelson (Mother, Lucy, Thomaston, Georgia); and McNamara (Mother, Anamae, Stratford, Connecticut).\r\n\r\n(PRIMARY SOURCE RESEARCH NOTE: Reference the German researcher's correspondence earlier on the White crew, the tail number of Patterson's ship was identified as this plane having crashed at Friedrichsrode - Komberg).",
    "acmAircraftPosition": "Slot Element Right Wing",
    "acmSquadron": null,
    "acmSquadronPos": "High Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-7658",
    "misMissionNo": 41,
    "acmPlaneRemarks": "Eye-witness accounts from returning crews stated that this ship was believed to be the plane which blew up in flames and crashed just before reaching the target area at 1318 hours. One such report reported (2) parachutes being seen while another stated that no chutes were observed. Heavy attacks by enemy fighters were being engaged by the Group formation all during this approach to target. The German ground report rendered by Report # LPEN 381 on 11 March 1944 at 2130 hours stated that this plane and (3) dead crewmen were found at a crash site at Waltershausen/Tuner at 1320 hours, 24 February 1944. The crash site was near the Thuringian forest.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: From surviving crewmember accounts, the bomb bay doors were opened just after the IP for the bomb run. At this time, flak was such that the Pilot employed some evasive action to avoid being hit by heavy barrages. The ship was damaged by this fire and caused the plane to fall slightly behind the formation as a tail-end straggler according to this report and, just as suddenly, the crew was jumped by enemy fighters which finished the severe damage to their plane. This account continued to say that the ship was on fire in the bomb bays which was attributed to a short in electrical circuitry (ostensibly from enemy firing hitting the front portion of the fuselage at the 2 o'clock position) and this electrical wiring emergency ran from the radio compartment back to the Putt-Putt' emergency generator, which shorted and created a fire. The Pilot's last interphone message then was: \"Close the bomb bay doors; close the bomb bay doors\" according to this member's (the Tail Gunner) statement. He further noted that the Flight Engineer later had told him that the Pilot, Co-Pilot and Radio Operator were all in their positions - dead, when the ship was abandoned. He stated also that though one of the Waist Gunners (Walla) had successfully bailed out through the aft camera hatch, that he felt this man's parachute failed to open as he was never seen or heard of again. It was later seen that the Engineer had suffered burns about the face, and the tail gunner had experienced some back injuries when these men met at prisoner interrogation at Dulag-Luft. This mission was this crew's third.\r\n\r\nBURIAL RECORDS: A German Report, cited above, noted that (3) dead were found in the plane's wreckage, but these men could not be identified. They were later interred on 4 March 1944 in the town cemetery at Waltershausen in graves numbered 301, 302, and 303 within Area IV of this location. Who exactly these crewmen were is not determinable from the MACR records. However, the U.S. National overseas Cemetery listings reflect that Lt. Johnston is buried in the ARDENNES Cemetery, Grave C-11-12 and Lt. Kelleher was also interred in the ARDENNES site, Grave C-2020. Sgt. Walla, the Waist Gunner was buried at the U.S. NETHERLANDS (MARGRATEN) plot in Grave F-17-4. There is no record of any type regarding the final burial place of the Radio Operator, Sgt. Hight. Purple Heart awards were made to these members.\r\n\r\nNEXT OF KIN IN WWII: The MACR record reflects the following: Johnston (Mother, Belle C., of Quincy, Illinois); Kelleher (Father, Daniel, Crockett, California); Cihon (Mother, Tillie, Cleveland, Ohio); Leidl (Mother, Mirra, Boerne, Texas); Rodewicz (Wife, Eleanor L., Shenandoah, Pennsylvania); Haussmann (Mother, Mrs. Frederick, Union City, New Jersey); Kelly (Father, Avery, Kellyville, Oklahoma); Hight (Brother, Edwin A. Philadelphia, Pennsylvania); and Walla (Sister, Mrs. Rose Dubiel, Philadelphia, Pennsylvania).\r\n\r\n(PRIMARY SOURCE RESEARCH NOTE: The German letter cited earlier for this mission does identify this plane's crash site in the Waltershausen vicinity - which was verified by the tail number found).",
    "acmAircraftPosition": "Low Element Left Wing",
    "acmSquadron": null,
    "acmSquadronPos": "Low Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  },
  {
    "acAircraftNo": "42-100102",
    "misMissionNo": 41,
    "acmPlaneRemarks": "MISSION LOSS CIRCUMSTANCES:  Returning aircrews of the Group gave an eyewitness account as follows: \"Aircraft seen to explode just before bombs away; altitude of 20,500 feet, heading (60) degrees; ship was attacked by (5) FWI190s; number (3) engine was on fire and the plane peeled off to the right; no chutes seen\".\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: The Radio Operator Mitchell had a brief account of this crew's emergency and loss. Summarized, the plane was under attack by (5) enemy FW190 fighters, two engines were knocked out, and the ship caught on fire. He stated further in this later 'Casualty Questionnaire' given after release from POW status that he knew that five men, though in good physical condition, did not leave their normal crew positions to bail out and went down with the aircraft (presumably due to the ship's explosion). These crew members were: Navigator Stankan; Bombardier Haglund; Waist Gunner Meshon; Tail Gunner Helbing and the other Waist Gunner Pr,vce. Note: On Gunner Pryce, the MACR notes that he survived, and was taken as a POW.\r\n\r\nBURIAL RECORDS: One German Report, Airfield Command Nordhausen #KU987, dated 14 March 1944, cited the recovery of one of the dead crewmembers, found in the aircraft wreckage, that of Lt. Haglund. He was found on the outskirts of Ruhla, about (50) meters southwest of Thiel/Schucharit. The report noted further that the deceased member could not be recovered until 14 March because of the salvage work on the plane. Lt. Haglund was buried in the cemetery St. Trinitas in Ruhla/Thueringen, Section H, Row 6 and Grave 4 at 1500 hours, 15 March 1944. The U.S. National overseas Cemetery listing has Lt. Haglund now interred in the NETHERLANDS (Margraten) LOCATION, Grave D-2-22. Sgt. Helbing also was recovered from Germany and is interred at MARGRATEN, Grave D-14-10. Both men received the Air Medal with Oak Leaf Cluster and Purple Heart. There are no records existing in this MACR in regard to the recovery or burials of Lt. Stankan or Sgt. Meshon.\r\n\r\nNEXT OF KIN DATA IN WWII: Recorded MACR data is: Cox (Wife, Thelma, Elisabeth, New Jersey); Halsworth (Mother, Cheresa Marie Halsworth, Indianapolis, Indiana); Stankan (Brother, John Jr., Jerome, Pennsylvania); Haglund (Wife, Lois G., Minneapolis, Minnesota); Mitchell (Mother, May P., Sayville, New York); Pryce (Brother, Al, Broken Box, Nebraska); Martin (Mother, Stella, Pocahontas, Arkansas); Meshon (Mother, Rebecca, Philadelphia, Pennsylvania); Sicard (Father, Alfred, Barton, Vermont); Helbing (Mother, Marie R., Toledo, Ohio).\r\n\r\nPRIMARY SOURCE RESEARCH NOTE: The German researcher's letter noted above stated that the tail number of the crashed aircraft of the Cox Crew was found at the site in the close vicinity of Ruhla-Dornsenberg.",
    "acmAircraftPosition": "High Element Lead",
    "acmSquadron": null,
    "acmSquadronPos": "High Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 19
  },
  {
    "acAircraftNo": "42-100344",
    "misMissionNo": 41,
    "acmPlaneRemarks": "Eye-witness accounts of returning crews gave a report of one Group aircraft going down at 1354 hours, after target, at coordinates 50-35N; 35-OOE. The ship climbed up into a stall and began burning, as the tail fell off while under attack by (4) enemy aircraft. No parachutes were reported seen. This summary appeared to be that on the plight of the Schlossberg Crew's aircraft. No other such accounts were given.\r\n\r\nINDIVIDUAL ACCOUNTS OF CREWMEN FATES: No information regarding exists in this MACR record. According to this record, all crewmembers were taken as POWs. No German records are present as well on the ultimate status of this crew.\r\n\r\nBURIAL RECORDS: None. All airmen survived.\r\n\r\nNEXT OF KIN DATA IN WWII: Information recorded is as follows: Schlossberg (Mother, Jennie L., Detroit, Michigan); Blake (Mother, Eleanor, Charleston, West Virginia); Bender (Mother, Jennie A., St. Joseph, Michigan); Ranta (Mother, Ella, Morrisville, New Hampshire); Cooke (Mother, Roxie B., Pikesville, North Carolina); Williams (Mother, Ann, Media, Pennsylvania); Sexton (Mother, Dora, Seattle, Washington); Allen ( Mother, Elsie, Chicago, Illinois); Overton (Mother, Mrs. David Overton, North Providence, Rhode Island); and Bailey (Mother, Roxana 1., Poco, West Virginia).\r\n\r\n(PRIMARY SOURCE RESEARCH NOTE: There is no data available on this aircraft's crash site, as given in the German letter cited above. (Note: This 'no data' summary is undoubtedly due to this aircrew's after-target emergency which took place many miles west of Gotha on the outbound leg homeward and some (33) minutes after \"bombs away\").",
    "acmAircraftPosition": "Low Element Left Wing",
    "acmSquadron": null,
    "acmSquadronPos": "High Squadron",
    "acmGroupPosition": "Unknown",
    "acmWingPos": "Unknown",
    "acmFormationSize": "B-24 [ A ]",
    "acmAircraftStatus": 17
  }
]